Repository: Asuse420/genie-toolkit
Catalog: po/*.po
Languages: es, fa, zh_cn

source: ${p} {hotter|higher} than ${x}
fa: ${p} {گرمتر|بالاتر} از ${x}

source: ${p} {cooler|colder|lower} than ${x}
fa: ${p} {سردتر|سردتر|کمتر} از ${x}

source: ${p} {farther|more distant|longer} than ${x}
fa: ${p} {دورتر|دورتر|طولانی تر} از ${x}

source: ${p} {nearer|closer|shorter} than ${x}
fa: ${p} {نزدیکتر|نزدیک تر|کوتاه تر} از ${x}

source: ${p} {larger|bigger} than ${x}
fa: ${p} {بزرگتر|بزرگتر} از ${x}

source: ${p} smaller than ${x}
fa: ${p} کوچکتر از ${x}

source: ${p} {faster|quicker|speedier} than ${x}
fa: ${p} {سریعتر|سریعتر|سریعتر} از ${x}

source: ${p} {slower|more slowly} than ${x}
fa: ${p} {آهسته تر|آهسته تر} از ${x}

source: ${p} {after|later than} ${x}
fa: ${p} {بعد از|بعد از} ${x}

source: ${p} {before|earlier than|sooner than} ${x}
fa: ${p} {قبل از|از قبل|زودتر از} ${x}

source: {greater|higher|larger|more} ${p} than ${x}
fa: {بزرگتر|بالاتر|بزرگتر|بیشتر} ${p} از ${x}

source: {smaller|lower|less} ${p} than ${x}
fa: {کوچکتر|کمتر|کمتر} ${p} از ${x}

source: {more expensive|more costly|more} ${p} than ${x}
fa: {گرانتر|هزینه ی بیشتر|بیشتر} ${p} از ${x}

source: {less expensive|cheaper|less} ${p} than ${x}
fa: {ارزانتر|ارزانتر|کمتر} ${p} از ${x}

source: longer ${p} than ${x}
fa: طولانی تر ${p} از ${x}

source: shorter ${p} than ${x}
fa: کوتاهتر ${p} از ${x}

source: {larger|more} ${p} than ${x}
fa: {بزرگتر|بیشتر} ${p} از ${x}

source: {smaller|less} ${p} than ${x}
fa: {کوچکتر|کمتر} ${p} از ${x}

source: {heavier|larger} ${p} than ${x}
fa: {سنگین تر|بزرگتر} ${p} از ${x}

source: {lighter|smaller} ${p} than ${x}
fa: {سبکتر|کوچکتر} ${p} از ${x}

source: {hotter|higher} ${p} than ${x}
fa: {گرمتر|بالاتر} ${p} از ${x}

source: {cooler|colder|lower} ${p} than ${x}
fa: {سردتر|سردتر|کمتر} ${p} از ${x}

source: {farther|more distant|longer} ${p} than ${x}
fa: {دورتر|دورتر|طولانی تر} ${p} از ${x}

source: {nearer|closer|shorter} ${p} than ${x}
fa: {نزدیکتر|نزدیک تر|کوتاه تر} ${p} از ${x}

source: {bigger|larger} ${p} than ${x}
fa: {بزرگتر|بزرگتر} ${p} از ${x}

source: smaller ${p} than ${x}
fa: کوچکتر ${p} از ${x}

source: {faster|quicker|speedier} ${p} than ${x}
fa: {سریعتر|سریعتر|سریعتر} ${p} از ${x}

source: {slower|more slowly} ${p} than ${x}
fa: {آهسته تر|آهسته تر} ${p} از ${x}

source: later ${p} than ${x}
fa: بعدا ${p} از ${x}

source: {earlier|sooner} ${p} than ${x}
fa: {قبل از این|زودتر} ${p} از ${x}

source: no ${param}
fa: نه ${param}

source: zero ${param}
fa: صفر ${param}

source: ${p} containing ${x}
fa: ${p} که شامل ${x}

source: ${p} containing no ${x}
fa: ${p} که هیچ کدوم از اینها را شامل نمی شود ${x}

source: ${x} in the ${p}
fa: ${x} در ${p}

source: ${p} containing ${both_prefix} ${pair}
fa: ${p} که شامل ${both_prefix} ${pair}

source: ${both_prefix} ${pair} in the ${p}
fa: ${both_prefix} ${pair} در ${p}

source: ${p} containing either ${pair}
fa: ${p} که شامل هر کدوم ${pair}

source: either ${pair} in the ${p}
fa: یا ${pair} در ${p}

source: ${p} {containing|including} ${x} {but not|without|but no} ${y}
fa: ${p} {که شامل|شامل} ${x} {اما نه|بدون|اما نه} ${y}

source: {no|zero} ${p}
fa: {نه|صفر} ${p}

source: {no|zero} ${p} {with|having} ${f} {lower than|below} ${x}
fa: {نه|صفر} ${p} {با|داشتن} ${f} {کمتر از|در پایین} ${x}

source: {no|zero} ${p} {with|having} ${f} {greater than|above} ${x}
fa: {نه|صفر} ${p} {با|داشتن} ${f} {بیشتر از|بالای} ${x}

source: ${p} {with|having} ${f} {greater than|above} ${x}
fa: ${p} {با|داشتن} ${f} {بیشتر از|بالای} ${x}

source: ${p} {with|having} ${f} {lower than|below} ${x}
fa: ${p} {با|داشتن} ${f} {کمتر از|در پایین} ${x}

source: ${p} {with|having} ${f}
fa: ${p} {با|داشتن} ${f}

source: ${v} ${p} {with|having} ${f} {greater than|above} ${x}
fa: ${v} ${p} {با|داشتن} ${f} {بیشتر از|بالای} ${x}

source: {more than|at least|no fewer than} ${x} ${p}
fa: {بیشتر از|حداقل|کمتر از} ${x} ${p}

source: {fewer than|at most|no more than} ${x} ${p}
fa: {کمتر از|بیشتر|نه بیشتر از} ${x} ${p}

source: no more than ${v} ${p} {with|having} ${f} {lower than|below} ${x}
fa: نه بیشتر از ${v} ${p} {با|داشتن} ${f} {کمتر از|در پایین} ${x}

source: at most ${v} ${p} {with|having} ${f} {lower than|below} ${x}
fa: به بیشترین حد ${v} ${p} {با|داشتن} ${f} {کمتر از|در پایین} ${x}

source: fewer than ${v} ${p} {with|having} ${f} {lower than|below} ${x}
fa: کمتر از ${v} ${p} {با|داشتن} ${f} {کمتر از|در پایین} ${x}

source: more than ${v} ${p} {with|having} ${f} {greater than|above} ${x}
fa: بیشتر از ${v} ${p} {با|داشتن} ${f} {بیشتر از|بالای} ${x}

source: at least ${v} ${p} {with|having} ${f} {greater than|above} ${x}
fa: حداقل ${v} ${p} {با|داشتن} ${f} {بیشتر از|بالای} ${x}

source: {total|sum} ${p} {of|being} ${x}
fa: {کل|جمع} ${p} {از|وجود} ${x}

source: {total|sum} ${p} {greater than|more than|above} ${x}
fa: {کل|جمع} ${p} {بزرگتر از|بیشتر از|بالای} ${x}

source: {total|sum} ${p} {lower than|less than|below} ${x}
fa: {کل|جمع} ${p} {کمتر از|کمتر از|در پایین} ${x}

source: {total|sum} ${f} of ${p} {of|being} ${x}
fa: {کل|جمع} ${f} از ${p} {از|وجود} ${x}

source: {total|sum} ${f} of ${p} {greater than|more than|higher than} ${x}
fa: {کل|جمع} ${f} از ${p} {بزرگتر از|بیشتر از|بیشتر از} ${x}

source: {total|sum} ${f} of ${p} {smaller than|less than|lower than} ${x}
fa: {کل|جمع} ${f} از ${p} {کوچکتر از|کمتر از|کمتر از} ${x}

source: average ${p} {of|being} ${x}
fa: متوسط ${p} {از|وجود} ${x}

source: average ${p} {greater than|more than|above} ${x}
fa: متوسط ${p} {بیشتر از|بیشتر از|بالای} ${x}

source: average ${p} {lower than|less than|below} ${x}
fa: متوسط ${p} {کمتر از|کمتر از|در پایین} ${x}

source: average ${f} of ${p} {of|being} ${x}
fa: متوسط ${f} از ${p} {از|وجود} ${x}

source: average ${f} of ${p} {greater than|more than|higher than} ${x}
fa: متوسط ${f} از ${p} {بیشتر از|بیشتر از|بیشتر از} ${x}

source: average ${f} of ${p} {smaller than|less than|lower than} ${x}
fa: متوسط ${f} از ${p} {کوچکتر از|کمتر از|کمتر از} ${x}

source: {maximum|highest} ${p} {of|being} ${x}
fa: {حداکثر|بالاترین} ${p} {از|وجود} ${x}

source: {maximum|highest} ${p} {greater than|more than|above} ${x}
fa: {حداکثر|بالاترین} ${p} {بیشتر از|بیشتر از|بالای} ${x}

source: {maximum|highest} ${p} {lower than|less than|below} ${x}
fa: {حداکثر|بالاترین} ${p} {کمتر از|کمتر از|در پایین} ${x}

source: {maximum|highest} ${f} of ${p} {of|being} ${x}
fa: {حداکثر|بالاترین} ${f} از ${p} {از|بودن} ${x}

source: {maximum|highest} ${f} of ${p} {greater than|more than|higher than} ${x}
fa: {حداکثر|بالاترین} ${f} از ${p} {بزرگتر از|بیشتر از|بیشتر از} ${x}

source: {maximum|highest} ${f} of ${p} {smaller than|less than|lower than} ${x}
fa: {حداکثر|بالاترین} ${f} از ${p} {کوچکتر از|کمتر از|کمتر از} ${x}

source: {minimum|lowest} ${p} {of|being} ${x}
fa: {حداقل|کمترین} ${p} {از|وجود} ${x}

source: {minimum|lowest} ${p} {greater than|more than|above} ${x}
fa: {حداقل|کمترین} ${p} {بیشتر از|بیشتر از|بالای} ${x}

source: {minimum|lowest} ${p} {lower than|less than|below} ${x}
fa: {حداقل|کمترین} ${p} {کمتر از|کمتر از|در پایین} ${x}

source: {minimum|lowest} ${f} of ${p} {of|being} ${x}
fa: {حداقل|کمترین} ${f} از ${p} {از|وجود} ${x}

source: {minimum|lowest} ${f} of ${p} {greater than|more than|higher than} ${x}
fa: {حداقل|کمترین} ${f} از ${p} {بیشتر از|بیشتر از|بیشتر از} ${x}

source: {minimum|lowest} ${f} of ${p} {smaller than|less than|lower than} ${x}
fa: {حداقل|کمترین} ${f} از ${p} {کوچکتر از|کمتر از|کمتر از} ${x}

source: both
fa: هر دو

source: around here
fa: در اطراف اینجا

source: near here
fa: در نزدیکی اینجا

source: nearby
fa: در نزدیکی

source: around me
fa: در اطراف من

source: in this area
fa: در این حوزه

source: {in|around|near} ${x}
fa: {در|در اطراف|نزدیک} ${x}

source: ${p} is ${x}
fa: ${p} این است ${x}

source: good
fa: خوب

source: great
fa: عالی

source: nice
fa: خوب

source: decent
fa: با احترام

source: within ${distance} {|radius|of here|from here|from me|of me|of this area|of my location|from current location}
fa: در درون ${distance} {|شعاع|از اینجا|از اینجا|از من|من|این منطقه|محل محل من|از محل فعلی}

source: within ${distance} {|radius} {of|from} ${place}
fa: در درون ${distance} {|شعاع} {از|از} ${place}

source: the ${p}
fa: این ${p}

source: its ${p}
fa: آن ${p}

source: their ${p}
fa: آنها ${p}

source: the ${p1} and ${p2}
fa: این ${p1} و ${p2}

source: the ${p1} , ${p2} {,|} and ${p3}
fa: این ${p1} ${p2} {,|} و ${p3}

source: {both|} ${outParams} of ${table}
fa: {هر دو|} ${outParams} از ${table}

source: ${outParams} of the ${table}
fa: ${outParams} از ${table}

source: where is the ${table}
fa: کجاست ${table}

source: does {the||any} ${table} have ${p}
fa: انجام می دهد {این|| هر کدام} ${table} دارایی ${p}

source: does {the||any} ${table} ${p}
fa: انجام می دهد {این|| هر کدام} ${table} ${p}

source: is {the|} ${table} ${p}
fa: این است {این|} ${table} ${p}

source: the ${outParam} of ${table}
fa: این ${outParam} از ${table}

source: the ${outParam} of the ${table}
fa: این ${outParam} از ${table}

source: ${outParam} {do|does} {the|} ${table} have
fa: ${outParam} {انجام دهید|انجام می دهد} {این|} ${table} دارایی

source: the ${outParam} of new ${table}
fa: این ${outParam} از ${table}

source: the ${outParam} of the new ${table}
fa: این ${outParam} از ${table}

source: new ${table}
fa: جدید ${table}

source: some number
fa: چند رقم

source: some value
fa: مقداری ارزش

source: something
fa: چیزی

source: some amount
fa: مقداری

source: some time
fa: زمانی

source: a certain time
fa: یک زمان مشخص

source: some date
fa: چند روز

source: a certain date
fa: یک تاریخ مشخص

source: some location
fa: در برخی نقاط

source: a location
fa: یک مکان

source: some place
fa: در جایی

source: a place
fa: یک مکان

source: a certain place
fa: یک مکان مشخص

source: somewhere
fa: جایی

source: some duration
fa: مدت زمان

source: some amount of time
fa: مقداری زمان

source: some size
fa: اندازه ای

source: a certain size
fa: یک اندازه مشخص

source: a certain weight
fa: یک وزن مشخص

source: a certain temperature
fa: یک دمای مشخص

source: some distance
fa: فاصله ای

source: some length
fa: کمی طول

source: some volume
fa: مقداری صدا

source: a certain volume
fa: یک حجم مشخص

source: some speed
fa: سرعتی کمی

source: a certain speed
fa: سرعت مشخصی

source: some image
fa: یه تصویر

source: some picture
fa: چند تصویر

source: some photo
fa: چند عکس

source: somebody
fa: کسی

source: someone
fa: کسی

source: some one
fa: یکی

source: some person
fa: یک نفر

source: some phone number
fa: چند شماره تلفن

source: some email address
fa: چند آدرس ایمیل

source: some file
fa: یه جورایی

source: some directory
fa: بعضی از فهرستها

source: some folder
fa: یه سری پوشه

source: some url
fa: یه سری url

source: some website
fa: بعضی از وب سایتها

source: some link
fa: یه لینک

source: the {number|total number|count} of {|the|this|that} ${t}
fa: این {شماره|تعداد کل|شمارش} از {|این|این|که} ${t}

source: the total ${p} of {|the|this|that} ${t}
fa: کل ${p} از {|این|این|که} ${t}

source: the {average|mean} ${p} of {|the|this|that} ${t}
fa: این {متوسط|متوسط} ${p} از {|این|این|که} ${t}

source: the average ${p} of {|the|this|that} ${t}
fa: متوسط ${p} از {|این|این|این} ${t}

source: the {minimum|lowest} ${p} of {|the|this|that} ${t}
fa: در {حداقل|کمترین} ${p} از {|این|این|این} ${t}

source: the {maximum|highest} ${p} of {|the|this|that} ${t}
fa: این {حداکثر|بالاترین} ${p} از {|این|این|آن} ${t}

source: the distance {of|to} ${table} {from here|}
fa: فاصله {از|به} ${table} {از اینجا|}

source: the distance {of|to} the ${table} {from here|}
fa: فاصله {از|به} این ${table} {از اینجا|}

source: how {far|near|close} ${table} is {from here|}
fa: چگونه {دور|نزدیک|بستن} ${table} این است {از اینجا|}

source: how {far|near|close} the ${table} is {from here|}
fa: چطور {دور|نزدیک|بستن} این ${table} این است {از اینجا|}

source: the distance {of|to} ${table} from ${place}
fa: فاصله {از|به} ${table} از ${place}

source: the distance from ${place} {of|to} ${table}
fa: فاصله از ${place} {از|به} ${table}

source: the distance {of|to} the ${table} from ${place}
fa: فاصله {از|به} این ${table} از ${place}

source: the distance from ${place} {of|to} the ${table}
fa: فاصله از ${place} {از|به} این ${table}

source: how {far|near|close} from ${place} ${table} is
fa: چطور {دور|نزدیک|بستن} از ${place} ${table} این است

source: how {far|near|close} ${table} is from ${place}
fa: چگونه {دور|نزدیک|بستن} ${table} از ${place}

source: how {far|near|close} from ${place} the ${table} is
fa: چگونه {دور|نزدیک|بسته بندی} از ${place} این ${table} این است

source: how {far|near|close} the ${table} is from ${place}
fa: چگونه {دور|نزدیک|بستن} این ${table} از ${place}

source: the number of ${p} {of|in|in the} ${table}
fa: تعداد ${p} {از|در|در} ${table}

source: the number of ${p} {of|in} the ${table}
fa: تعداد ${p} {از|در} این ${table}

source: the number of ${p} with ${filter} {of|in|in the} ${table}
fa: تعداد ${p} با ${filter} {از|در|در} ${table}

source: the number of ${p} with ${filter} {of|in} the ${table}
fa: تعداد ${p} با ${filter} {از|در} این ${table}

source: how {far|near|close} {is|are} ${table} {from here|} {?|}
fa: چگونه {دور|نزدیک|بستن} {این است|اینها} ${table} {از اینجا|} {?|}

source: how {far|near|close} {is|are} the ${table} {from here|} {?|}
fa: چگونه {دور|نزدیک|بستن} {این است|اینها} این ${table} {از اینجا|} {?|}

source: how {far|near|close} {is|are} ${table} {from|to} ${place} {?|}
fa: چگونه {دور|نزدیک|بستن} {این است|اینها} ${table} {از|به} ${place} {?|}

source: how {far|near|close} {is|are} the ${table} {from|to} ${place} {?|}
fa: چگونه {دور|نزدیک|بستن} {این است|اینها} این ${table} {از|به} ${place} {?|}

source: how many ${p} {does|do} ${table} have ?
fa: چند تا ${p} {انجام می دهد|انجام دهید} ${table} داشته باشید ؟

source: how many ${p} {in a|in|in the} ${table} ?
fa: چند تا ${p} {در یک|در|در} ${table} ؟

source: how many ${p} are there {in a|in|in the} ${table} ?
fa: چند تا ${p} وجود دارند {در یک|در|در} ${table} ؟

source: how many ${p} {does|do} the ${table} have ?
fa: چند تا ${p} {انجام می دهد|انجام دهید} این ${table} داشته باشید ؟

source: how many ${p} in the ${table} ?
fa: چند تا ${p} در ${table} ؟

source: how many ${p} are there in the ${table} ?
fa: چند تا ${p} در ${table} ؟

source: how many ${p} with ${filter} {does|do} ${table} have ?
fa: چند تا ${p} با ${filter} {انجام می دهد|انجام دهید} ${table} داشته باشید ؟

source: how many ${p} with ${filter} {in a|in|in the} ${table} ?
fa: چند تا ${p} با ${filter} {در یک|در|در} ${table} ؟

source: how many ${p} with ${filter} are there {in a|in|in the} ${table} ?
fa: چند تا ${p} با ${filter} وجود دارند {در یک|در|در} ${table} ؟

source: how many ${p} with ${filter} {does|do} the ${table} have ?
fa: چند تا ${p} با ${filter} {انجام می دهد|انجام دهید} این ${table} داشته باشید ؟

source: how many ${p} with ${filter} in the ${table} ?
fa: چند تا ${p} با ${filter} در ${table} ؟

source: how many ${p} with ${filter} are there in the ${table} ?
fa: چند تا ${p} با ${filter} در ${table} ؟

source: how many ${table} are there ?
fa: چند تا ${table} آیا آنجاست ؟

source: {please|} count the ${table}
fa: {لطفا|} شمارش ${table}

source: how many ${p} are {in|in the} ${table} ?
fa: چند تا ${p} اینها {در|در} ${table} ؟

source: how many ${p} {do|does} ${table} have ?
fa: چند تا ${p} {انجام دهید|انجام می دهد} ${table} داشته باشید ؟

source: {nearest|closest} ${table} {|from here|to here|to me}
fa: {نزدیکترین|نزدیکترین} ${table} {|از اینجا|تا اینجا|برای من}

source: {nearest|closest} ${table}
fa: {نزدیکترین|نزدیکترین} ${table}

source: {farthest|most far away} ${table}
fa: {دورترین|خیلی دور} ${table}

source: {nearest|closest} ${table} to ${place}
fa: {نزدیکترین|نزدیکترین} ${table} به ${place}

source: ${table} {that is|which is} {nearest|closest} to ${place}
fa: ${table} {این|که} {نزدیکترین|نزدیکترین} به ${place}

source: ${table} {nearest|closest} to ${place}
fa: ${table} {نزدیکترین|نزدیکترین} به ${place}

source: {farthest|most far away} ${table} from ${place}
fa: {دورترین|در دورترین نقطه} ${table} از ${place}

source: ${table} {that is|which is} {farthest|most far away} from ${place}
fa: ${table} {این|که} {دورترین|خیلی دورتر} از ${place}

source: ${table} {farthest|most far away} from ${place}
fa: ${table} {دورترین|دورتر از ما} از ${place}

source: ${table} with the {most|highest number of|largest number of|largest count of} ${p}
fa: ${table} با {بیشتر|تعداد بالا|تعداد بزرگ تری از|بزرگترین شمارش} ${p}

source: ${table} with the {least|fewest|smallest number of|tiniest number of|smallest count of} ${p}
fa: ${table} با {کم ترین|تعداد کمتری|کوچکترین تعداد|کوچکترین تعداد|کوچکترین شمارش} ${p}

source: ${table} with the {fewest|smallest number of} ${p}
fa: ${table} با {تعداد کمتری|کوچکترین تعداد} ${p}

source: ${table} {with|having} ${filter}
fa: ${table} {با|داشتن} ${filter}

source: ${table} {which|that} {is|are} ${filter}
fa: ${table} {که|که} {این است|اینها} ${filter}

source: ${table} {which|that} ${filter}
fa: ${table} {که|که} ${filter}

source: ${table} and ${filter}
fa: ${table} و ${filter}

source: ${table} {and having|and with|, with} ${filter}
fa: ${table} {و داشتن|و با|با} ${filter}

source: ${table} and {is|are} ${filter}
fa: ${table} و {این است|اینها} ${filter}

source: ${table} {and|} ${filter}
fa: ${table} {و|} ${filter}

source: ${table} {is|are} ${filter}
fa: ${table} {این است|اینها} ${filter}

source: ${table} {is|are} {|a|the|an} ${filter}
fa: ${table} {این است|اینها} {|الف|این|یک} ${filter}

source: ${table} {get|have|gets|has} ${filter}
fa: ${table} {دست پیدا کردن|دارایی|بدست می آید|دارای} ${filter}

source: ${table} and {get|have|gets|has} ${filter}
fa: ${table} و {بدست آوری|دارایی|بدست می آید|این کار را انجام داده} ${filter}

source: {get|take|retrieve} ${table} {and then|then} ${action}
fa: {دست پیدا کردن|برداشت|پیدا کردن} ${table} {و سپس|پس} ${action}

source: ${table} {and then|then|,} ${action}
fa: ${table} {و سپس|پس|,} ${action}

source: after {you get|taking|getting|retrieving} ${table} ${action}
fa: بعد از {شما می گیرید|برداشتن|بدست آوردن|بازیابی} ${table} ${action}

source: ${command} {with the same|with identical|using the same} ${joinArg}
fa: ${command} {با همان|با یکسان|با استفاده از همان} ${joinArg}

source: ${action} after {getting|taking|you get|you retrieve} ${table}
fa: ${action} بعد از {بدست آوردن|برداشتن|شما می گیرید|شما دریافت می کنید} ${table}

source: ${stream} ${action} if ${filter}
fa: ${stream} ${action} اگر ${filter}

source: {monitor|watch|check for new} ${table} {and then|then} ${action}
fa: {نظارت|تماشا|برای دیدن چیز جدیدی} ${table} {و سپس|پس} ${action}

source: {monitor|watch} ${table} {and then|then} ${action}
fa: {نظارت|تماشا} ${table} {و سپس|پس} ${action}

source: ${rule} {with the same|with identical|using the same} ${joinArg}
fa: ${rule} {با همان|با یکسان|از همان} ${joinArg}

source: ${action} after checking for new ${table}
fa: ${action} بعد از چک برای جدید ${table}

source: ${stream} ${imperative_verb_for_search} {|what is} ${table}
fa: ${stream} ${imperative_verb_for_search} {|چه چیزی است} ${table}

source: ${stream} ${generic_verb_for_search} {|what is} ${table}
fa: ${stream} ${generic_verb_for_search} {|چه چیزی است} ${table}

source: ${timer} {tell me|give me|show me|present|retrieve|pull up} ${table}
fa: ${timer} {به من بگو|به من بده|به من نشان بده|حاضر شدن|پیدا کردن|بالا بکشیم} ${table}

source: {tell me|give me|show me|present|retrieve|pull up} ${table} ${timer}
fa: {به من بگو|به من بده|به من نشان بده|حاضر|پیدا کردن|بالا بکشیم} ${table} ${timer}

source: i am looking for
fa: من دنبال آن هستم

source: i would like
fa: من دوست دارم

source: i want
fa: من می خواهم

source: i need
fa: من نیاز دارم

source: i am looking to
fa: من به دنبال

source: i would like to
fa: دوست دارم

source: i want to
fa: من می خواهم

source: i need to
fa: من باید

source: please
fa: لطفا

source: search for
fa: جستجو برای

source: search
fa: جستجو

source: find
fa: پیدا کردن

source: get
fa: دست پیدا کردن

source: retrieve
fa: پیدا کردن

source: show me
fa: به من نشان بده

source: tell me
fa: به من بگو

source: give me
fa: به من بده

source: find me
fa: پیدا کنم

source: i am looking for a particular
fa: من به دنبال یک فرد خاص هستم

source: i am looking for a certain
fa: من دنبال یک سری

source: i need some information about
fa: من به اطلاعاتی در مورد

source: i would like information about
fa: من اطلاعات در مورد

source: i would like to hear about
fa: من می خواهم در مورد

source: i want to know
fa: می خواهم بدانم

source: i need to know
fa: من نیاز دارم که بدانم

source: i would like to know
fa: دوست دارم بدونم

source: a
fa: الف

source: an
fa: یک

source: the
fa: در

source: some
fa: بعضی ها

source: any
fa: هر کدام

source: all
fa: همه

source: all the
fa: همه ی

source: every
fa: هر

source: a list of
fa: یک لیست از

source: a list of all
fa: یک لیست از همه

source: the list of
fa: لیست

source: the list of all
fa: لیست همه

source: get ${generic_article} ${table}
fa: دست پیدا کردن ${generic_article} ${table}

source: {please|} {list|enumerate} ${table}
fa: {لطفا|} {فهرست|شمارش} ${table}

source: ${generic_preamble_for_answer} the ${table}
fa: ${generic_preamble_for_answer} این ${table}

source: ${generic_verb_for_search} the ${table}
fa: ${generic_verb_for_search} این ${table}

source: {show me|tell me} what is ${proj}
fa: {به من نشان بده|به من بگو} چه چیزی ${proj}

source: {show me|tell me} what is the ${proj}
fa: {به من نشان بده|به من بگو} چه چیزی ${proj}

source: {what|which} ${table} ?
fa: {چه|که} ${table} ؟

source: {what|which} {are|is} {the|} ${table} ?
fa: {چه ؟|که} {اینها|این است} {این|} ${table} ؟

source: {is|are} there {any|} ${table} ?
fa: {این است|اینها} آنجا {هر کدام|} ${table} ؟

source: {what|which} {are|is} {the|} ${table}
fa: {چه ؟|که} {اینها|این است} {این|} ${table}

source: {what|which} ${table}
fa: {چه ؟|که} ${table}

source: {what|which} is the ${table} ?
fa: {چه ؟|که} این ${table} ؟

source: {which|what} ${table} ?
fa: {که|چه ؟} ${table} ؟

source: {who|which person|which individual} ${table} ?
fa: {چه کسی|چه کسی|که فرد} ${table} ؟

source: {who is the person|who is the one|who is the individual} ${table} ?
fa: {چه کسی این شخص است|چه کسی این یکی است|که فرد است} ${table} ؟

source: whose ${table} ?
fa: که ${table} ؟

source: who ${table} ?
fa: که ${table} ؟

source: what is ${proj} ?
fa: چه چیزی ${proj} ؟

source: who is ${proj} ?
fa: چه کسی ${proj} ؟

source: what are ${proj} ?
fa: چه چیزهایی هستند ${proj} ؟

source: who are ${proj} ?
fa: که ${proj} ؟

source: {what|which} ${proj} ?
fa: {چه ؟|که} ${proj} ؟

source: where {is|are} {|the} ${table}
fa: در کجا {این است|اینها} {|این} ${table}

source: {if|when} ${filter} in ${table}
fa: {اگر|زمانی} ${filter} در ${table}

source: {alert me|inform me|let me know|i get notified|i get alerted} ${stream}
fa: {خبر کن|خبر بده|بزارید|من خبر می گیرم|من خبر می شوم} ${stream}

source: send me {a message|an alert|a notification|a pop up notification|a popup notification} ${stream}
fa: بفرستم {پیام|یک هشدار|یک اعلامیه|یک خبرتیای پاپ اپ|یک خبرتیای پاپ اپ} ${stream}

source: {let me know|notify me} {of|about} {changes|updates} in ${proj}
fa: {بزارید|خبر بده} {از|در مورد} {تغییرات|به روز کردن} در ${proj}

source: {alert me|tell me|notify me|let me know} ${stream}
fa: {خبر کن|به من بگو|خبر بده|بزارید} ${stream}

source: {auto|automatically|continuously} ${stmt}
fa: {خودکنترل|به صورت خودکار|به طور مداوم} ${stmt}

source: automatically ${stmt}
fa: به صورت خودکار ${stmt}

source: {monitor|watch} ${table}
fa: {نظارت|تماشا} ${table}

source: {let me know|notify me} {of|about} {changes|updates} in ${table}
fa: {بزارید|خبر بده} {از|در مورد} {تغییرات|به روز کردن} در ${table}

source: {monitor|watch} ${table} and {alert me|notify me|inform me|warn me} {if|when} ${filter}
fa: {نظارت|نگاه کردن} ${table} و {خبر کن|خبر بده|خبر بده|به من هشدار بده} {اگر|زمانی} ${filter}

source: ${command} {with|having} ${param}
fa: ${command} {با|داشتن} ${param}

source: send me a {reminder|message} ${timer}
fa: یک پیام بفرستید {یادآوری|پیام} ${timer}
