Repository: Asuse420/genie-toolkit
Catalog: po/*.po
Languages: es, fa, zh_cn

source: Link: ${title} <${link}>
fa: لینک ${title} <${link}>

source: Sound effect: ${name}
fa: افکت صوتی: ${name}

source: Media: ${url}
fa: رسانه: ${url}

source: ^(what|who|where|when|why|how)|\?\s*$
fa: ^ (چه|که|در کجا|زمانی|چرا|چگونه)|\ ؟\ s*$

source: Sorry I couldn't help on that.
es: Lo siento, no pude ayudar.
fa: متاسفم که نتوانستم در این باره کمک کنم

source: Did you mean ${command}?
fa: منظورت این بود که ${command}

source: Syntax error {at ${error.fileName}|} {line ${error.lineNumber}|}: ${error.message}
fa: خطای ساختاری {در ${error.fileName}|} {خط ${error.lineNumber}|} (تشویق حاضرین) ${error.message}

source: Sorry, I cannot contact the Genie service. Please check your Internet connection and try again later.
fa: متاسفم ، من نمی توانم با خدمات Genie تماس بگیرم. لطفا ارتباط اینترنت خود را چک کنید و بعدا دوباره امتحان کنید

source: Sorry, there seems to be a problem with the Genie service at the moment. Please try again later.
fa: متاسفم ، به نظر می رسد که در حال حاضر مشکلی با خدمات Genie وجود دارد. لطفا بعدا دوباره امتحان کنید

source: Sorry, I had an error processing your command: ${error}.
fa: متاسفم ، در پردازش دستور شما یک اشتباه داشتم ${error}

source: Sorry, that did not work: ${error}.
fa: متاسفم ، این کار نکرد ${error}

source: Please answer yes or no.
fa: لطفا پاسخ مثبت یا نه دهید

source: Could you choose one of the following?
es: ¿Podría elegir uno de los siguientes?
fa: آیا می توانید یکی از اینها را انتخاب کنید ؟

source: Could you give me a measurement?
fa: می تونید یه اندازه گیری به من بدید ؟

source: Could you give me a number?
es: ¿Podría insertar un número?
fa: می تونید به من یک شماره بدهید ؟

source: Could you give me a date?
es: ¿Podría insertar una fecha?
fa: می تونید یه ملاقاتی بهم بدید ؟

source: Could you give me a time of day?
es: ¿Podría insertar una hora del día?
fa: می تونید یه ساعت از روز بهم بدید ؟

source: Could you upload a picture?
es: ¿Podría subir una foto?
fa: می تونید یک عکس آپلود کنید ؟

source: Could you give me a place?
es: ¿Podría insertar un lugar?
fa: می تونید یه جای بدید ؟

source: Could you give me a phone number?
es: ¿Podría insertar un número de teléfono?
fa: می تونید به من یک شماره تلفن بدهید ؟

source: Could you give me an email address?
es: ¿Podría insertar una dirección de correo electrónico?
fa: می تونید به من آدرس ایمیلی بدید ؟

source: Which is interesting, because I'll take anything at all. Just type your mind!
es: Lo cual es interesante, porque me va bien cualquier cosa. ¡Libera tu imaginación!
fa: که جالبه ، چون من هر چیزی رو که میخوام می گیرم. فقط ذهنتون رو تایپ کنید

source: Sorry, I did not understand that: ${error}. Can you rephrase it?
fa: متاسفم ، من متوجه نشدم ${error} می تونید اینو دوباره بنویسید ؟

source: Sorry, I did not understand that. Can you rephrase it?
es: Lo siento, no entiendí. ¿Puede reformularlo?
fa: متاسفم ، من این را درک نکردم. می توانید آن را دوباره بنویسید ؟

source: Sorry, I did not understand that: ${error}.
fa: متاسفم ، من متوجه نشدم ${error}

source: Sorry, I did not understand that.
es: Lo siento, no entiendí.
fa: متاسفم ، من این را درک نکردم

source: Sign up for Genie
fa: برای Genie ثبت نام کنید

source: To use this command you must first create a personal Genie account.
fa: برای استفاده از این فرمان شما باید ابتدا یک حساب شخصی جینی بسازید

source: To receive notifications you must first create a personal Genie account.
fa: برای دریافت خبرها باید ابتدا یک حساب شخصی جینی ایجاد کنید

source: I cannot find any ${name} ${device} device. Which device do you want to use?
fa: من نمی توانم هیچکدام را پیدا کنم ${name} ${device} دستگاه. از کدام دستگاه می خواهید استفاده کنید ؟

source: You have multiple {${name}| }${device} devices. Which one do you want to use?
fa: چند تای شما دارید {${name}|} ${device} دستگاه ها. کدام را می خواهید استفاده کنید ؟

source: Multiple contacts match “${name}”. Who do you mean?
fa: تماس های چندگانه با هم مطابقت دارند ${name} منظورت از چه کسی است ؟

source: You need to enable ${device} before you can use that command.
fa: شما باید این قابلیت را داشته باشید ${device} قبل از اینکه بتوانید از آن فرمان استفاده کنید

source: Configure ${device}
fa: تنظیم ${device}

source: Sorry, to use ${device}, you must create a personal Almond account.
fa: متاسفم ، برای استفاده ${device} , شما باید یک حساب کاربری کاربری شخصی برای الماس بسازید

source: You do not have a ${device} configured. You will need to enable ${choices} before you can use that command.
fa: شما یک ${device} تنظیم شده. شما باید این را فعال کنید ${choices} قبل از اینکه بتوانید از آن دستور استفاده کنید

source: You do not have a ${device} configured. You will need to configure it inside your ${factory} before you can use that command.
fa: شما یک ${device} تنظیم شده. شما باید آن را درون ${factory} قبل از اینکه بتوانید از آن دستور استفاده کنید

source: Configure a new skill
es: Configure una nueva habilidad
fa: مهارت جدیدی را تنظیم کنید

source: No contact matches “${name}”.
fa: هیچ تماسی با این بازی مطابقت ندارد ${name} »

source: Who do you want to contact?
es: ¿Con quién desea contactar?
fa: با چه کسی می خواهید تماس بگیرید ؟

source: Sorry, I cannot find any ${entity_type} matching “${name}”.
fa: متاسفم ، نمی توانم هیچکدام را پیدا کنم ${entity_type} تطبیقی "" ${name} »

source: Sorry, I cannot find any location matching “${location}”.
fa: متاسفم ، نمی توانم هیچ موقعیتی را پیدا کنم که با "" ${location} »

source: What is your phone number?
fa: شماره تلفن شما چیست ؟

source: You must verify your email address by clicking the verification link before you can use it to receive notifications.
fa: شما باید آدرس ایمیل خود را با کلیک بر روی لینک تایید تاییدی تایید کنید قبل از اینکه بتوانید از آن برای دریافت خبرها استفاده کنید

source: What is your email address?
fa: آدرس ایمیل شما چیست ؟

source: Thank you! Please verify your email address by clicking the verification link before continuing.
fa: متشکرم! لطفاً آدرس ایمیل خود را قبل از ادامه به وسیله ی لینک تایید تایید تایید کنید

source: Where are you now?
es: ¿Donde está ahora?
fa: حالا کجایید ؟

source: What is your home address?
es: ¿Cuál es la dirección de su domicilio?
fa: آدرس منزلتان چیست ؟

source: What is your work address?
es: ¿Cuál es la dirección de su trabajo?
fa: آدرس کاری شما چیست ؟

source: What time does your morning begin?
es: ¿A qué hora comienza su mañana?
fa: صبحتان کی شروع می شود ؟

source: What time does your evening begin?
es: ¿A qué hora comienza la noche para usted?
fa: عصر شما چه وقت شروع می شود ؟

source: How would you like to be notified?
fa: چگونه می خواهید خبر شوید ؟

source: This app has no description
fa: این برنامه هیچ توضیحی ندارد
zh_cn: 该应用没有描述

source: Unknown device
fa: دستگاه ناشناخته

source: Description not available
fa: توضیحی در دسترس نیست

source: today
fa: امروز

source: yesterday
fa: دیروز

source: tomorrow
fa: فردا

source: last ${weekday}
fa: آخر ${weekday}

source: next ${weekday}
fa: آخر ${weekday}

source: ${date} at ${time}
fa: ${date} در ${time}

source: [Latitude: ${latitude} deg, Longitude: ${longitude} deg]
fa: [عرض جغرافیایی ${latitude} درجه ، طول ${longitude} درجه

source: here
fa: اینجا

source: home
fa: خانه

source: work
fa: کار

source: the morning
fa: صبح

source: the evening
fa: عصر

source: now
es: ahora
fa: حالا

source: this year
fa: امسال

source: start of day
fa: شروع روز

source: ${time} on day ${day} of ${month} , ${year}
fa: ${time} در روز ${day} از ${month} ${year}

source: this millisecond
fa: این میلی ثانیه

source: this second
fa: این ثانیه

source: this minute
fa: در این لحظه

source: this hour
fa: این ساعت

source: this week
fa: این هفته

source: this month
fa: این ماه

source: the start of ${unit}
fa: شروع ${unit}

source: the end of ${unit}
fa: پایان ${unit}

source: ${time} on ${weekday}
fa: ${time} در ${weekday}

source: {them [plural=other]|it [plural=one]}
fa: {آنها [plural=other]|این [plural=one]}

source: the ${name} [plural=name[plural]]
fa: این ${name} [plural=name[plural]]

source: ${offset} past ${base}
fa: ${offset} گذشته ${base}

source: ${offset} before ${base}
fa: ${offset} قبل از ${base}

source: ${lhs} plus ${rhs}
fa: ${lhs} بعلاوه ${rhs}

source: ${lhs} minus ${rhs}
fa: ${lhs} منهای ${rhs}

source: ${lhs} times ${rhs}
fa: ${lhs} زمان ${rhs}

source: ${lhs} divided by ${rhs}
fa: ${lhs} تقسیم شده با ${rhs}

source: ${lhs} modulo ${rhs}
fa: ${lhs} ماژولو ${rhs}

source: ${lhs} to the power of ${rhs}
fa: ${lhs} به قدرت ${rhs}

source: the distance between ${lhs} and ${rhs}
fa: فاصله بین ${lhs} و ${rhs}

source: the maximum ${arg}
fa: حداکثر ${arg}

source: the minimum ${arg}
fa: حداقل ${arg}

source: the average ${arg}
fa: متوسط ${arg}

source: the total ${arg}
fa: کل ${arg}

source: the number of ${arg}
fa: تعداد ${arg}

source: ${time} today
fa: ${time} امروز

source: ${time} tomorrow
fa: ${time} فردا

source: ${time} on ${date}
fa: ${time} در ${date}

source: ${value} for which ${filter}
fa: ${value} برای اینکه ${filter}

source: the ${field} of ${value}
fa: این ${field} از ${value}

source: the selection on the screen
fa: انتخاب در صفحه

source: the program ID
fa: ID برنامه

source: the device type
fa: نوع دستگاه

source: the requester
fa: درخواست کننده

source: the result
fa: نتیجه

source: true
fa: درست است

source: false
fa: درست است

source: any value of ${argcanonical} is acceptable
fa: هر ارزشی از ${argcanonical} قابل قبول است

source: not ${expr}
fa: نه ${expr}

source: current time
fa: زمان حال

source: my location
fa: محل من

source: the ${param} of the ${expr}
fa: این ${param} از ${expr}

source: for the ${expr} , ${filter}
fa: برای ${expr} ${filter}

source: the ${query} with index ${index}
fa: این ${query} با فهرست ${index}

source: ${query} such that ${filter} [plural=query[plural]]
fa: ${query} که ${filter} [plural=query[plural]]

source: the ${param} of ${query}
fa: این ${param} از ${query}

source: the number of ${query[plural=other]}
fa: تعداد ${query[plural=other]}

source: the average ${param} in ${query[plural=other]}
fa: متوسط ${param} در ${query[plural=other]}

source: the minimum ${param} in ${query[plural=other]}
fa: حداقل ${param} در ${query[plural=other]}

source: the maximum ${param} in ${query[plural=other]}
fa: حداکثر ${param} در ${query[plural=other]}

source: the sum of the ${param} in ${query[plural=other]}
fa: جمع ${param} در ${query[plural=other]}

source: the number of ${param[plural=other]} in ${query[plural=other]}
fa: تعداد ${param[plural=other]} در ${query[plural=other]}

source: the ${query[plural=one]} with the minimum ${param} [plural=one]
fa: این ${query[plural=one]} با حداقل ${param} [plural=one]

source: the ${query[plural=one]} with the maximum ${param} [plural=one]
fa: این ${query[plural=one]} با حداکثر ${param} [plural=one]

source: the ${limit} ${query[plural=other]} with the minimum ${param} [plural=other]
fa: این ${limit} ${query[plural=other]} با حداقل ${param} [plural=other]

source: the ${limit} ${query[plural=other]} with the maximum ${param} [plural=other]
fa: این ${limit} ${query[plural=other]} با حداکثر ${param} [plural=other]

source: the ${query} sorted by increasing ${param} [plural=query[plural]]
fa: این ${query} با افزایش مرتب شده ${param} [plural=query[plural]]

source: the ${query} sorted by decreasing ${param} [plural=query[plural]]
fa: این ${query} با کاهش مرتب شده اند ${param} [plural=query[plural]]

source: ${indices.length:plural: one {element ${indices} of the ${query} [plural=one]} other {elements ${indices} of the ${query} [plural=other]} }
fa: ${indices.length:plural: one {element ${indices} از ${query} [plural=one] } بقیه { عناصر ${indices} از ${query} [plural=other] } }

source: the first ${limit} ${query[plural=other]} [plural=other]
fa: اولین ${limit} ${query[plural=other]} [plural=other]

source: the last ${limit} ${query[plural=other]} [plural=other]
fa: آخرین ${limit} ${query[plural=other]} [plural=other]

source: ${limit} elements starting from ${base} of the ${query[plural=other]} [plural=other]
fa: ${limit} عناصری که از ${base} از ${query[plural=other]} [plural=other]

source: ${frequency:plural: =1 {every ${interval}} =2 {twice every ${interval}} other {${frequency} times every ${interval}} } starting ${base}
fa: ${frequency:plural: =1 {every ${interval} } =2 { هر دو بار ${interval} } بقیه { ${frequency} هر بار ${interval} } } شروع ${base}

source: ${frequency:plural: =1 {every ${interval}} =2 {twice every ${interval}} other {${frequency} times every ${interval}} }
fa: ${frequency:plural: =1 {every ${interval} } =2 { هر دو بار ${interval} } بقیه { ${frequency} هر بار ${interval} } }

source: every day at ${time} until ${expiration}
fa: هر روز در ${time} تا زمانی که ${expiration}

source: every day at ${time}
fa: هر روز در ${time}

source: at ${date}
fa: در ${date}

source: when {there are new ${table[plural=other]}|${table[plural=one]} changes} if ${filter}
fa: زمانی {چیزهای جدیدی وجود دارد ${table[plural=other]}|${table[plural=one]} تغییرات} اگر ${filter}

source: when the ${table[plural=one]} changes if ${filter}
fa: وقتی که ${table[plural=one]} تغییراتی که اگر ${filter}

source: when {there are new ${table[plural=other]}|${table[plural=one]} changes}
fa: زمانی {چیزهای جدیدی وجود دارد ${table[plural=other]}|${table[plural=one]} تغییرات}

source: when the ${table[plural=one]} changes
fa: وقتی که ${table[plural=one]} تغییرات

source: ${stream} and it becomes true that ${filter}
fa: ${stream} و این حقیقت می شود که ${filter}

source: ${stream} , the ${param}
fa: ${stream} , در ${param}

source: get {${query[plural=other]}|${query[plural=one]}}
fa: دست پیدا کردن {${query[plural=other]}|${query[plural=one]}}

source: get the ${query[plural=one]}
fa: دست به کار ${query[plural=one]}

source: do the following : ${stream} , ${queries} , and then ${action}
fa: این کار را انجام دهید ${stream} ${queries} , و سپس ${action}

source: notify you ${stream}
fa: خبرتان می دهد ${stream}

source: notify me ${stream}
fa: خبرتان می دهد ${stream}

source: ${queries} , and then ${action}
fa: ${queries} و سپس ${action}

source: ${query} and then ${action}
fa: ${query} و سپس ${action}

source: let ${name} be ${value}
fa: اجازه بده ${name} این است که ${value}

source: tell ${principal} : ${command}
fa: بگو ${principal} (تشویق حاضرین) ${command}

source: ${confirm} if ${filter} [plural=confirm[plural]]
fa: ${confirm} اگر ${filter} [plural=confirm[plural]]

source: your clock
fa: ساعت شما

source: send you messages , configure new accounts and open links
fa: پیامها را برای شما ارسال می کند ، حسابهای جدید را تنظیم می کند و لینک ها را باز می کند

source: your ${device}
fa: شما ${device}

source: perform any action on your ${device}
fa: هر کاری را در مورد ${device}

source: anyone
fa: هر کسی

source: anyone in the ${group} group
fa: هر کسی در ${group} گروه

source: if ${filter} , the requester
fa: اگر ${filter} , درخواست کننده

source: ${principal} is allowed to perform any action
fa: ${principal} اجازه انجام هر کاری را دارد

source: ${principal} is allowed to ${action}
fa: ${principal} اجازه دارد ${action}

source: ${principal} is allowed to read all your data
fa: ${principal} اجازه می دهد که همه داده های شما را بخواند

source: ${principal} is allowed to read all your data and then perform any action with it
fa: ${principal} اجازه می دهد که همه داده های شما را بخواند و بعد هر کاری را با آن انجام دهد

source: ${principal} is allowed to read all your data and then use it to ${action}
fa: ${principal} اجازه می دهد که همه داده های شما را بخواند و سپس از آن برای ${action}

source: ${principal} is allowed to read the ${query}
fa: ${principal} اجازه می دهد که ${query}

source: ${principal} is allowed to read {${query[plural=other]}|the ${query[plural=one]}}
fa: ${principal} اجازه می دهد که بخواند {${query[plural=other]}|این ${query[plural=one]}}

source: ${principal} is allowed to read the ${query} and then perform any action with it
fa: ${principal} اجازه می دهد که ${query} و سپس هر کاری را با آن انجام دهید

source: ${principal} is allowed to read {${query[plural=other]}|the ${query[plural=one]}} and then perform any action with it
fa: ${principal} اجازه می شود که بخواند {${query[plural=other]}|این ${query[plural=one]}} و بعد هر کاری را با آن انجام دهید

source: ${principal} is allowed to read the ${query} and then use it to ${action}
fa: ${principal} اجازه می دهد که ${query} و سپس از آن استفاده می کنیم ${action}

source: ${principal} is allowed to read {${query[plural=other]}|the ${query[plural=one]}} and then use it to ${action}
fa: ${principal} اجازه می شود بخواند {${query[plural=other]}|این ${query[plural=one]}} و سپس از آن استفاده می کنیم ${action}

source: yes
fa: بله

source: no
fa: نه

source: I did not understand
fa: من نمی فهمیدم

source: train me again
fa: دوباره یادم بگیر

source: go back
fa: برگرد

source: show more results
fa: نتایج بیشتری را نشان دهید

source: no action
fa: هیچ کاری انجام نشده

source: show debugging information
fa: اطلاعات شطرنجی را نشان دهید

source: maybe
fa: شاید

source: cancel
fa: لغو می کنیم

source: stop
fa: متوقف کردن

source: help
fa: کمک

source: make a new command
fa: یک دستور جدید بسازید

source: wake up
fa: بیدار شوند

source: choice number ${choice}
fa: عدد انتخاب ${choice}

source: {i was thinking more of|i would like|i am looking for|do you have|can you find|is there [plural=one]|are there [plural=other]|that does not sound great , do you have}
fa: {بیشتر به این فکر می کردم|من دوست دارم|من دنبال این هستم|آیا شما|می توانید|وجود دارد [plural=one]|وجود دارند [plural=other]|این خیلی خوب به نظر نمی رسه ، آیا شما}

source: {the|that} ${noun} [plural=noun[plural]]
fa: {این|که} ${noun} [plural=noun[plural]]

source: {alright,| great!|awesome !|sounds good !|sounds good ,|perfect !}
fa: {بسیار خب ،|عالیه|عالیه|خوب به نظر می رسه|خوب به نظر می رسه ،|عالیه}

source: {hello !|hi !}
fa: {سلام|سلام}

source: {i do not like that|i do not like that , do you have any other option ?}
fa: {من این را دوست ندارم|من این را دوست ندارم ، آیا گزینه دیگری دارید ؟}

source: {i like that|yes i like that|sure i like that|sounds good}
fa: {من این را دوست دارم|بله من این را دوست دارم|مطمئناً من این را دوست دارم|خوب به نظر می رسه}

source: {no|actually , no|that will not work|no , thank you|not yet|actually , not yet}
fa: {نه|در واقع نه|که کار نمی کند|نه ، متشکرم|هنوز نه|در واقع ، هنوز نه}

source: {can you tell me more ?|can you tell me more about it ?|can you give me more info ?|give me more info !|give me more information .|tell me more .}
fa: {می تونید بیشتر بگی ؟|می تونید در موردش بیشتر بگویی ؟|می تونید اطلاعات بیشتری به من بدید ؟|اطلاعات بیشتری به من بده|اطلاعات بیشتری به من بدهید|بیشتر بگو}

source: {would you like to {learn more|{know|hear} more about it}|are you interested to hear more about it}
fa: {دوست دارید {بیشتر یاد بگیرید|{میدانیم|شنیدن} بیشتر در موردش}|آیا علاقه دارید که بیشتر در مورد آن بشنوید}

source: {yes|yes , please|yeah}
fa: {بله|بله ، لطفا|بله}

source: {ok {thank you|thanks} that is all i need.}
fa: {بسیار خوب {متشکرم|متشکرم} این همه چیزی است که من نیاز دارم}

source: {{thank you|thanks} {,|} {that will be all|that will be all for now|this is good for now|this is what i need} .|thank your for your help{!|, this is what i needed.}}
fa: {{متشکرم|متشکرم} {,|} {این همه خواهد بود|این همه برای الان خواهد بود|این برای حال خوبه|این چیزی است که من نیاز دارم}|از کمکتون متشکرم {!|این چیزی بود که من نیاز داشتم}}

source: {no thanks|no, thanks|no i am good thanks|no need thanks|no {thank you|thanks} {,|} {this is good for now|this is all i need|that will be it|this will do|that will be it for now|this will do for now|that will be all}.}
fa: {نه متشکرم|نه ، متشکرم|نه من خوبم ممنون|نیازی نیست متشکرم|نه {متشکرم|متشکرم} {,|} {این برای حال خوب است|این همه چیزی است که من نیاز دارم|این همان چیزی است که|این کار را می کند|این برای همینه|این برای همین کار را می کند|این همه چیز خواهد بود} .}

source: {is there anything else i can help you with|can i help you with anything else|do you need anything else|anything else for you today}?
fa: {آیا چیزی هست که من می توانم به شما کمک کنم ؟|می توانم به شما در هر چیز دیگری کمک کنم|آیا به چیز دیگری نیاز دارید ؟|امروز هر چیز دیگری برای شما}

source: {sorry,|i am sorry,|}
fa: {متاسفم ،|من متاسفم ،|}

source: {ok, never mind|never mind then|alright, never mind|too bad, alright}
fa: {خب ، مهم نیست|پس مهم نیست|خب ، مهم نیست|خیلی بد است ، بسیار خوب}

source: {which {one|1} would you recommend?|what is your favorite?|surprise me! just pick one please.}
fa: {که {یک|۱} پیشنهاد می کنید ؟|کدام مورد علاقه شما است ؟|تعجب کنید! لطفا یکی را انتخاب کنید}

source: {it does not matter. {|can you suggest one?}|i {do not have a|have no} preference. {|what do you recommend?}|i have no preference. {please make a recommendation|which {one|1} is best?}}
fa: {مهم نیست {|می تونید یکی پیشنهاد کنید ؟}|من {که|هیچ} ترجیح {|پیشنهادتان چیست ؟}|من هیچ علاقه ای ندارم {لطفا توصیه کنید|که {یک|۱} بهترینه ؟}}

source: {no {.|,} {can you suggest one|please make a recommendation|which {one|1} is best?|you choose for me!|surprise me!}|i have no preference. please make a recommendation.}
fa: {نه {.|,} {آیا می توانید یکی از اینها را پیشنهاد کنید|لطفا توصیه کنید|که {یک|۱} بهترینه ؟|شما برای من انتخاب می کنید|تعجب کنید}|من هیچ علاقه ای ندارم. لطفا توصیه کنید}

source: {do you want|would you prefer|would you like|are you interested in|are you looking for}
fa: {آیا می خواهید|ترجیح می دهید|دوست دارید|آیا علاقه دارید|آیا دنبالش هستی}

source: what would you like to {know|hear}?
fa: چه دوست دارید {بدانید|بشنوید}

source: {again !|another one|do this again|do it again|do the last command}
fa: {دوباره|یکی دیگر|دوباره این کار را بکن|دوباره انجامش بده|آخرین فرمان را انجام دهید}

source: {please|} {try again|try this again|do the last command|do it again}
fa: {لطفا|} {دوباره امتحان کنید|دوباره امتحان کنید|آخرین فرمان را انجام دهید|دوباره انجامش بده}

source: {ok|great|i like that|yes i like that|sure i like that|sounds good} {,|} {notify me when it changes|notify me when it changes|subscribe to changes|let me know of changes|notify me of this|subscribe to this}
fa: {بسیار خب|عالی|من این را دوست دارم|بله من این را دوست دارم|مطمئنا من این را دوست دارم|خوب به نظر می رسه} {,|} {هنگامی که تغییر می کند به من خبر دهید|هنگامی که تغییر می کند به من اطلاع بدهید|به تغییراتی که می خواهم مراجعه کنید|اجازه دهید تغییرات را بدانم|از این خبر بده|به این مراجعه کنید}

source: ${name} is a ${info[plural=one]}
fa: ${name} یک ${info[plural=one]}

source: ${name} is ${filter[plural=one]}
fa: ${name} این است ${filter[plural=one]}

source: ${name} has ${filter[plural=one]}
fa: ${name} این کار را کرده ${filter[plural=one]}

source: the ${param} is ${v}
fa: این ${param} این است ${v}

source: the ${param} are ${pair}
fa: این ${param} اینها ${pair}

source: the distance is ${v}
fa: فاصله این است ${v}

source: ${b1} and ${b2}
fa: ${b1} و ${b2}

source: the ${p} equal to ${x}
fa: این ${p} برابر با ${x}

source: ${table} {with|having} ${filter} [plural=table[plural]]
fa: ${table} {با|داشتن} ${filter} [plural=table[plural]]

source: ${table} {which|that} ${table[plural]:select:one{is}other{are}} ${filter} [plural=table[plural]]
fa: ${table} {که|که} ${table[plural]:select:one{is} بقیه {اینها}} ${filter} [plural=table[plural]]

source: ${table} {which|that} ${table[plural]:select:one{${filter[plural=one]}}other{${filter[plural=other]}}} [plural=table[plural]]
fa: ${table} {که|که} ${table[plural]:select:one{${filter[plural=one]}} بقیه {${filter[plural=other]}}} [plural=table[plural]]

source: ${table} and ${filter} [plural=table[plural]]
fa: ${table} و ${filter} [plural=table[plural]]

source: ${table} {and having|and with|, with} ${filter} [plural=table[plural]]
fa: ${table} {و داشتن|و با|با} ${filter} [plural=table[plural]]

source: ${table} and ${table[plural]:select:one{is}other{are}} ${filter} [plural=table[plural]]
fa: ${table} و ${table[plural]:select:one{is} بقیه { اینها } } ${filter} [plural=table[plural]]
