Repository: Asuse420/genie-toolkit
Catalog: po/*.po
Languages: es, fa, zh_cn

source: ${preamble} {are you looking for|how about|how about} ${proposal}
fa: ${preamble} {آیا دنبالش هستی ؟|چطور ؟|چطور ؟} ${proposal}

source: ${counterproposal_preamble} {a|any} ${request} .
fa: ${counterproposal_preamble} {الف|هر کدام} ${request}

source: {no ,|no|} {i am not in the mood for a|i do not like|i do not want} ${phrase}
fa: {نه ،|نه|} {من در حال حاضر برای|من دوست ندارم|من نمی خواهم} ${phrase}

source: {no ,|no|} ${request}
fa: {نه ،|نه|} ${request}

source: what ${p} ${prefer_question_phrase} ?
fa: چی ؟ ${p} ${prefer_question_phrase} ؟

source: what ${p1} and ${p2} ${prefer_question_phrase} ?
fa: چه ؟ ${p1} و ${p2} ${prefer_question_phrase} ؟

source: ${p1} and what ${p2} ${prefer_question_phrase} ?
fa: ${p1} و چه ${p2} ${prefer_question_phrase} ؟

source: what ${p1} ${prefer_question_phrase} and ${p2} ?
fa: چه ؟ ${p1} ${prefer_question_phrase} و ${p2} ؟

source: any preference of ${p} ?
fa: هر نوع ترجیحی ${p} ؟

source: do you have a specific ${p} in mind?
fa: آیا شما یک ${p} در ذهنتون ؟

source: do you have a preference of ${p} ?
fa: آیا شما ترجیحی ${p} ؟

source: do you have a preferred ${p} ?
fa: آیا شما علاقه ای به ${p} ؟

source: are you looking for a specific ${p} ?
fa: آیا شما به دنبال یک ${p} ؟

source: are you interested in a specific ${p} ?
fa: آیا شما به یک ${p} ؟

source: any preference of ${p1} or ${p2} ?
fa: هر نوع ترجیحی ${p1} یا ${p2} ؟

source: do you have a specific ${p1} or ${p2} in mind?
fa: آیا شما یک ${p1} یا ${p2} در ذهنتان ؟

source: do you have a preference of ${p1} or ${p2} ?
fa: آیا شما ترجیحی ${p1} یا ${p2} ؟

source: do you have a preferred ${p1} or ${p2} ?
fa: آیا شما یک نوع از ${p1} یا ${p2} ؟

source: are you looking for a specific ${p1} or ${p2} ?
fa: آیا شما به دنبال یک ${p1} یا ${p2} ؟

source: are you interested in a specific ${p1} or ${p2} ?
fa: آیا شما به یک چیز خاص علاقه دارید ${p1} یا ${p2} ؟

source: ${ctx} ${f1} or ${f2}
fa: ${ctx} ${f1} یا ${f2}

source: ${ctx} ${f1} or ${c}
fa: ${ctx} ${f1} یا ${c}

source: {are you looking for|would you like|do you need} something with ${question} ?
fa: {آیا دنبالش هستی ؟|دوست دارید|آیا به آن نیاز دارید} چیزی با ${question} ؟

source: {are you looking for|would you like|do you need} something ${question} ?
fa: {آیا دنبالش هستی ؟|دوست دارید ؟|آیا به آن نیاز دارید ؟} چیزی ${question} ؟

source: {are you looking for|would you like|do you need} something that ${question} ?
fa: {آیا دنبالش هستی ؟|دوست دارید ؟|آیا شما نیاز دارید} چیزی که ${question} ؟

source: {are you looking for|would you like|do you need} a ${table} {with|that has} ${question} ?
fa: {آیا دنبالش هستی ؟|دوست دارید ؟|آیا شما نیاز دارید} الف ${table} {با|که} ${question} ؟

source: {are you looking for|would you like|do you need} a ${question} ${table} ?
fa: {آیا دنبالش هستی ؟|دوست داری|آیا شما نیاز دارید} الف ${question} ${table} ؟

source: {are you looking for|would you like|do you need} a ${table} ${question} ?
fa: {آیا دنبالش هستی ؟|دوست دارید ؟|آیا شما نیاز دارید} الف ${table} ${question} ؟

source: {are you looking for|would you like|do you need} a ${table} that ${question} ?
fa: {آیا دنبالش هستی ؟|دوست دارید|آیا به آن نیاز دارید} الف ${table} این ${question} ؟

source: which one would you like ?
fa: کدوم را دوست دارید ؟

source: do you have a specific one in mind ?
fa: آیا شما یک نمونه خاص در ذهن دارید ؟

source: do you have any more information to narrow down the search ?
fa: آیا اطلاعات بیشتری برای محدود کردن جستجو دارید ؟

source: ${generic_preamble_for_answer} {a|the} ${query}
fa: ${generic_preamble_for_answer} {الف|این} ${query}

source: {yes|yes ,|} ${table}
fa: {بله|بله ،|} ${table}

source: {yes|yes ,|} ${table_action}
fa: {بله|بله ،|} ${table_action}

source: the ${param} does not matter .
fa: این ${param} مهم نیست

source: the ${param} is not an issue .
fa: این ${param} یک مشکل نیست

source: the ${param} is not important .
fa: این ${param} مهم نیست

source: the ${param} does not matter . can you suggest one ?
fa: این ${param} مهم نیست. می تونید یکی رو پیشنهاد کنید ؟

source: i {do not have a|have no} preference of ${param} .
fa: من {که|هیچی ندارند} ترجیح دادن ${param}

source: i {do not have a|have no} preference of ${param} . what do you recommend ?
fa: من {که|هیچی ندارند} ترجیح دادن ${param} . چه توصیه ای می کنید ؟

source: i have no preference of ${param} . please make a recommendation .
fa: من هیچ علاقه ای به ${param} لطفا توصیه کنید

source: {i do not care that it has|it need not have|i do not need} ${param}
fa: {مهم نیست که این|لازم نیست|من نیازی به این ندارم} ${param}

source: ${ctx} {the|the same} ${base} 's ${param} .
fa: ${ctx} {این|همان} ${base} "" ${param}

source: ${ctx} ${generic_preamble_for_answer} {the|the same} ${base} 's ${param} .
fa: ${ctx} ${generic_preamble_for_answer} {این|همان} ${base} "" ${param}

source: ${ctx} the same ${param} as the ${base} .
fa: ${ctx} همان ${param} به عنوان ${base}

source: ${ctx} ${generic_preamble_for_answer} the same ${param} as the ${base} .
fa: ${ctx} ${generic_preamble_for_answer} همان ${param} به عنوان ${base}

source: ${ctx} {the same as the|the} ${param} of the ${base} .
fa: ${ctx} {همان چیزی که|این} ${param} از ${base}

source: ${ctx} ${generic_preamble_for_answer} {the same as the|the} ${param} of the ${base} .
fa: ${ctx} ${generic_preamble_for_answer} {همان چیزی که|این} ${param} از ${base}

source: ${ans} {please|} .
fa: ${ans} { لطفا | }

source: reminder:
fa: یادآوری

source: alert:
fa: هشدار

source: notification from ${app}:
fa: از طریق ${app}

source: ${sorry} {there was an error in|an error occurred in} ${app}:
fa: ${sorry} {یک اشتباه در|یک اشتباه در} ${app}

source: ${sorry} {there was an error}:
fa: ${sorry} { یک اشتباه وجود داشت }

source: {send this to me|send it to me|i want to see this|i want this|send this} ${stream}
fa: {این را به من بفرستید|این را به من بفرستید|من می خواهم این را ببینم|من این را می خواهم|این را بفرستید} ${stream}

source: {do this|do it|do it automatically} ${stream}
fa: {این کار را بکن|انجامش بده|این کار را به صورت خودکار انجام دهید} ${stream}

source: debug
fa: ازبین رفتن

source: never mind
fa: بیخیال

source: stop it
fa: دست بکشید

source: shut up
fa: ببند

source: shush
fa: ششش

source: quiet
fa: ساکت

source: close
fa: بستن

source: yes please
fa: بله لطفا

source: yes , please
fa: بله ، لطفا

source: yeah
fa: بله

source: ok
fa: بسیار خب

source: okay
fa: بسیار خوب

source: yes yes
fa: بله بله

source: yes . yes
fa: بله. بله

source: no thanks
fa: نه ممنون

source: no , thanks
fa: نه ، متشکرم

source: nope
fa: نه

source: no no
fa: نه نه

source: no . no
fa: نه. نه

source: get ${query}
fa: دست پیدا کردن ${query}

source: show me ${query}
fa: به من نشان بده ${query}

source: {at|when it is} ${time}
fa: {در|زمانی که} ${time}

source: in the middle of the day
fa: در وسط روز

source: {{in|during} the morning|{when|after} {getting|waking|i {get|wake}} up}
fa: {{در|در طول} صبح|{زمانی|بعد از} {بدست آوردن|بیدار شدن|من {دست پیدا کردن|بیدار شدن}} بالا}

source: {{in|during} the {evening|night}|{when|before} {going to {sleep|bed}|i go to {sleep|bed}}|at bedtime}
fa: {{در|در طول} این {عصر|شب}|{زمانی|قبل از} {به {خواب|تخت خواب}|من به {خواب|تخت خواب}}|در زمان خواب}

source: noon
fa: ظهر

source: midday
fa: ظهر

source: midnight
fa: شب به نیمه

source: zero
fa: صفر

source: one
fa: یک

source: the end of the day
fa: آخر روز

source: the end of the week
fa: آخر هفته

source: the end of the month
fa: آخر ماه

source: the end of the year
fa: آخر سال

source: last week
fa: هفته ی گذشته

source: last month
fa: ماه گذشته

source: last year
fa: سال گذشته

source: next week
fa: هفته بعد

source: next month
fa: ماه بعد

source: next year
fa: سال بعد

source: ${year} s
fa: ${year} سال

source: jan
fa: ژانویه

source: january
fa: ژانویه

source: {jan|january} of ${year}
fa: {ژانویه|ژانویه} از ${year}

source: feb
fa: فوریه

source: february
fa: فوریه

source: {feb|february} of ${year}
fa: {فبروري|فوریه} از ${year}

source: mar
fa: ماه

source: march
fa: راهپیمایی

source: {mar|march} of ${year}
fa: {ماه|راهپیمایی} از ${year}

source: apr
fa: سه شنبه

source: april
fa: ماه آوریل

source: {apr|april} of ${year}
fa: {سه شنبه|ماه آوریل} از ${year}

source: may
fa: می تواند

source: may of ${year}
fa: می ${year}

source: jun
fa: جون

source: june
fa: ژوئن

source: {jun|june} of ${year}
fa: {جون|ژوئن} از ${year}

source: jul
fa: جولای

source: july
fa: جولای

source: {jul|july} of ${year}
fa: {جولای|جولای} از ${year}

source: aug
fa: اګ

source: august
fa: آگوست

source: {aug|august} of ${year}
fa: {اګ|آگوست} از ${year}

source: sep
fa: سپتامبر

source: sept
fa: سه

source: september
fa: سپتامبر

source: {sep|sept|september} of ${year}
fa: {سپتامبر|سه|سپتامبر} از ${year}

source: oct
fa: خُب ، این یک جورهایی است که

source: october
fa: ماه اکتبر

source: {oct|october} of ${year}
fa: {خُب ، این یک جورهایی است که|ماه اکتبر} از ${year}

source: nov
fa: نو

source: november
fa: نوامبر

source: {nov|november} of ${year}
fa: {نو|نوامبر} از ${year}

source: dec
fa: خُرد

source: december
fa: دسامبر

source: {dec|december} of ${year}
fa: {خُرد|دسامبر} از ${year}

source: mon
fa: نه

source: monday
fa: دوشنبه

source: last {mon|monday}
fa: آخر {نه|دوشنبه}

source: next {mon|monday}
fa: بعدی {نه|دوشنبه}

source: tue
fa: نکشید

source: tuesday
fa: شنبه

source: last {tue|tuesday}
fa: آخر {نکشید|شنبه}

source: next {tue|tuesday}
fa: بعدی {نکشید|شنبه}

source: wed
fa: ازدواج

source: wednesday
fa: چهارشنبه

source: last {wed|wednesday}
fa: آخر {ازدواج|چهارشنبه}

source: next {wed|wednesday}
fa: بعدی {ازدواج|چهارشنبه}

source: thu
fa: پس

source: thursday
fa: سه شنبه

source: last {thu|thursday}
fa: آخرین {پس|شنبه}

source: next {thu|thursday}
fa: بعدی {پس|سه شنبه}

source: fri
fa: جمعه

source: friday
fa: جمعه

source: last {fri|friday}
fa: آخر {جمعه|جمعه}

source: next {fri|friday}
fa: بعدی {جمعه|جمعه}

source: sat
fa: نشسته

source: saturday
fa: شنبه

source: last {sat|saturday}
fa: آخر {نشسته|شنبه}

source: next {sat|saturday}
fa: بعدی {نشسته|شنبه}

source: sun
fa: خورشید

source: sunday
fa: روز یکشنبه

source: last {sun|sunday}
fa: آخر {خورشید|روز یکشنبه}

source: next {sun|sunday}
fa: بعدی {خورشید|روز یکشنبه}

source: ${duration} ago
fa: ${duration} قبل از

source: ${duration} before ${pt}
fa: ${duration} قبل از ${pt}

source: {${duration} from now|in ${duration}}
fa: {${duration} از حالا|در ${duration}}

source: ${duration} after ${pt}
fa: ${duration} بعد از ${pt}

source: ${num} ms
fa: ${num} ثانیه

source: ${num} milliseconds
fa: ${num} ثانیه

source: ${num} s
fa: ${num} سال

source: ${num} seconds
fa: ${num} ثانیه

source: ${num} min
fa: ${num} دقیقه

source: ${num} minutes
fa: ${num} دقیقه

source: ${num} hours
fa: ${num} ساعت

source: ${num} days
fa: ${num} روزها

source: ${num} weeks
fa: ${num} هفته ها

source: ${num} months
fa: ${num} ماه

source: ${num} years
fa: ${num} سال

source: minute
fa: دقیقه

source: hour
fa: ساعت

source: day
fa: روز

source: week
fa: هفته

source: month
fa: ماه

source: year
fa: سال

source: ${num} byte
fa: ${num} بایت

source: ${num} kb
fa: ${num} کیلو نون

source: ${num} tb
fa: ${num} تایمز

source: ${num} kilobytes
fa: ${num} کیلوبایت

source: ${num} megabytes
fa: ${num} مگابایت

source: ${num} gigabytes
fa: ${num} گیگابایت

source: ${num} terabytes
fa: ${num} هزاران بیت

source: ${num} grams
fa: ${num} گرم

source: ${num} kilograms
fa: ${num} کیلوگرم

source: ${num} kg
fa: ${num} کیلو گرم

source: ${num} pounds
fa: ${num} پوند

source: ${num} lbs
fa: ${num} پا

source: ${num} ounces
fa: ${num} اینیم

source: ${num} oz
fa: ${num} هزاران هزار لیتر

source: ${num} c
fa: ${num} ج

source: ${num} centigrade
fa: ${num} درجه سانتیگراد

source: ${num} celsius
fa: ${num} سلولزیوس

source: ${num} degrees celsius
fa: ${num} درجه ی سانتیگراد

source: ${num} fahrenheit
fa: ${num} درجه حرارت درجه

source: ${num} degrees fahrenheit
fa: ${num} درجه ی فارنهایت

source: ${num} degrees
fa: ${num} درجه

source: ${num} m
fa: ${num} متر

source: ${num} meters
fa: ${num} متر

source: ${num} km
fa: ${num} کیلومتر

source: ${num} kilometers
fa: ${num} کیلومتر

source: ${num} mi
fa: ${num} هزارم

source: ${num} miles
fa: ${num} کیلومتر

source: ${num} ft
fa: ${num} فیت

source: ${num} in
fa: ${num} در

source: ${num} inches
fa: ${num} اینچ

source: ${num} cm
fa: ${num} سانتي متر

source: ${num} square meters
fa: ${num} متر مربع

source: ${num} square km
fa: ${num} کیلومتر مربع

source: ${num} square kilometers
fa: ${num} کیلومتر مربع

source: ${num} square ft
fa: ${num} قدم مربع

source: ${num} square feet
fa: ${num} متر مربع

source: ${num} cubic meters
fa: ${num} متر مکعب

source: ${num} cubic km
fa: ${num} کیلومتر مکعب

source: ${num} cubic kilometers
fa: ${num} کیلومتر مکعب

source: ${num} cubic ft
fa: ${num} فوت مکعب

source: ${num} cubic feet
fa: ${num} متر مکعب

source: ${num} liter
fa: ${num} لیتر

source: ${num} l
fa: ${num} ۱

source: ${num} ml
fa: ${num} میلی لیتر

source: ${num} floz
fa: ${num} آب شور

source: ${num} gallon
fa: ${num} لیتر

source: ${num} quart
fa: ${num} کوارت

source: ${num} pint
fa: ${num} پنت

source: ${num} cup
fa: ${num} لیوان

source: ${num} teaspoon
fa: ${num} لیوان چای

source: ${num} tablespoon
fa: ${num} لیوان

source: ${num} mph
fa: ${num} ساعت

source: ${num} m/s
fa: ${num} متر

source: ${num} kph
fa: ${num} ساعت

source: ${num} miles per hour
fa: ${num} کیلومتر در ساعت

source: ${num} kilometers per hour
fa: ${num} کیلومتر در ساعت

source: ${num} km/h
fa: ${num} کیلومتر / ساعت

source: ${num} w
fa: ${num} و

source: ${num} watt
fa: ${num} وات

source: ${num} kw
fa: ${num} کیلو

source: ${num} kilowatt
fa: ${num} کیلو وات

source: ${num} lx
fa: ${num} ۱ / ۵

source: ${num} lm
fa: ${num} اه

source: ${num} decibels
fa: ${num} دیسکیبل

source: where i am now
fa: جایی که من الان هستم

source: the area
fa: منطقه

source: the city
fa: شهر

source: my home
fa: خانه من

source: my neighborhood
fa: محله ی من

source: my office
fa: دفتر من

source: my workplace
fa: محل کار من

source: ${c1} and ${c2}
fa: ${c1} و ${c2}

source: ${c1} or ${c2}
fa: ${c1} یا ${c2}

source: ${c1} nor ${c2}
fa: ${c1} نه ${c2}

source: this
fa: این

source: it
fa: این

source: them
fa: آنها

source: that
fa: که

source: either one
fa: هر یک

source: either of them
fa: هر کدام از آنها

source: any of them
fa: هر کدام از آنها

source: any one of them
fa: هر کدام از آنها

source: the ${table}
fa: این ${table}

source: {every day|each day|daily|once a day} ${time}
fa: {هر روز|هر روز|هر روز|یکبار در روز} ${time}

source: {every day|each day|daily|twice a day} at ${time1} and ${time2}
fa: {هر روز|هر روز|هر روز|دوبار در روز} در ${time1} و ${time2}

source: on ${date}
fa: در ${date}

source: {once {each|every|per|a}|each|every} ${unit}
fa: {یکبار {هر کدام|هر|هر|الف}|هر کدام|هر} ${unit}

source: ${freq} times {each|every|per|a} ${unit}
fa: ${freq} زمان {هر کدام|هر|هر|الف} ${unit}

source: before ${t1}
fa: قبل از ${t1}

source: after ${t2}
fa: بعد از ${t2}

source: between ${t1} and ${t2}
fa: بین ${t1} و ${t2}

source: my location is ${loc}
fa: محل من ${loc}

source: my location is not ${loc}
fa: محل من ${loc}

source: i am at ${loc}
fa: من در ${loc}

source: i am not at ${loc}
fa: من در ${loc}

source: ${proj} {is|is exactly|is equal to} ${x}
fa: ${proj} {این است|دقیقا|برابر با} ${x}

source: ${proj} {is not|is n't|is different than} ${x}
fa: ${proj} {این نیست|این نیست|با} ${x}

source: the ${p} {is|is exactly|is equal to} ${x}
fa: این ${p} {این است|دقیقا|برابر با} ${x}

source: the ${p} {is not|is n't|is different than} ${x}
fa: این ${p} {این نیست|این نیست|متفاوت از} ${x}

source: ${p} is {greater than|higher than|larger than|more than|at least|not less than} ${x}
fa: ${p} این است {بیشتر از|بیشتر از|بزرگتر از|بیشتر از|حداقل|نه کمتر از} ${x}

source: ${p} is {smaller than|lower than|less than|at most|not more than} ${x}
fa: ${p} این است {کوچکتر از|کمتر از|کمتر از|بیشتر|نه بیشتر از} ${x}

source: ${p} is {more expensive|more costly|more} than ${x}
fa: ${p} این است {گرانتر|هزینه ی بیشتر|بیشتر} از ${x}

source: ${p} is {less expensive|cheaper|less} than ${x}
fa: ${p} این است {ارزانتر|ارزانتر|کمتر} از ${x}

source: ${p} is {longer than|no shorter than} ${x}
fa: ${p} این است {بیشتر از|نه کمتر از} ${x}

source: ${p} is {no longer than|shorter than} ${x}
fa: ${p} این است {نه بیشتر از|کوتاه تر از} ${x}

source: ${p} is {larger|more|no smaller|no less} than ${x}
fa: ${p} این است {بزرگتر|بیشتر|نه کوچکتر|کمتر} از ${x}

source: ${p} is {smaller|less|no larger|no more} than ${x}
fa: ${p} این است {کوچکتر|کمتر|نه بزرگتر|دیگر وجود ندارد} از ${x}

source: ${p} is {heavier|larger} than ${x}
fa: ${p} این است {سنگین تر|بزرگتر} از ${x}

source: ${p} is {lighter|smaller} than ${x}
fa: ${p} این است {سبکتر|کوچکتر} از ${x}

source: ${p} is {hotter|higher} than ${x}
fa: ${p} این است {گرمتر|بالاتر} از ${x}

source: ${p} is {cooler|colder|lower} than ${x}
fa: ${p} این است {سردتر|سردتر|کمتر} از ${x}

source: ${p} is {farther|more distant|longer} than ${x}
fa: ${p} این است {دورتر|دورتر|طولانی تر} از ${x}

source: ${p} is {nearer|closer|shorter|no longer|no farther} than ${x}
fa: ${p} این است {نزدیکتر|نزدیک تر|کوتاه تر|دیگر|نه دورتر} از ${x}

source: ${p} is {larger|bigger|no smaller} than ${x}
fa: ${p} این است {بزرگتر|بزرگتر|نه کوچکتر} از ${x}

source: ${p} is {smaller|no larger|no bigger} than ${x}
fa: ${p} این است {کوچکتر|نه بزرگتر|نه بزرگتر} از ${x}

source: ${p} is {faster|quicker|speedier} than ${x}
fa: ${p} این است {سریعتر|سریعتر|سریعتر} از ${x}

source: ${p} is {slower|more slowly} than ${x}
fa: ${p} این است {آهسته تر|آهسته تر} از ${x}

source: ${p} is {after|later than} ${x}
fa: ${p} این است {بعد از|بعد از} ${x}

source: ${p} is {before|earlier than|sooner than} ${x}
fa: ${p} این است {قبل از|از قبل|زودتر از} ${x}

source: the ${p} {contain|include} ${x}
fa: این ${p} {محتوی|شامل} ${x}

source: the ${p} do not {contain|include} ${x}
fa: این ${p} نه {محتویات|شامل} ${x}

source: the ${p} {contains|includes} ${x}
fa: این ${p} {شامل|شامل} ${x}

source: the ${p} does not {contain|include} ${x}
fa: این ${p} این کار را نمی کند {محتویات|شامل} ${x}

source: ${x} is in ${p}
fa: ${x} در ${p}

source: the ${p} {becomes|becomes equal to} ${x}
fa: این ${p} {تبدیل می شود|برابر می شود با} ${x}

source: ${p} {is now|becomes|goes} {greater than|higher than|larger than|more than|at least|not less than} ${x}
fa: ${p} {اکنون|تبدیل به|می رود} {بیشتر از|بیشتر از|بزرگتر از|بیشتر از|حداقل|کمتر از} ${x}

source: ${p} {is now|becomes|goes} {smaller than|lower than|less than|at most|not more than} ${x}
fa: ${p} {اکنون|تبدیل می شود|می رود} {کوچکتر از|کمتر از|کمتر از|بیشتر|نه بیشتر از} ${x}

source: ${p} {is now|becomes|goes} {more expensive|more costly|more} than ${x}
fa: ${p} {الان|تبدیل می شود|می رود} {گرانتر|هزینه ی بیشتر|بیشتر} از ${x}

source: ${p} {is now|becomes|goes} {less expensive|cheaper|less} than ${x}
fa: ${p} {الان|تبدیل می شود|می رود} {ارزانتر|ارزانتر|کمتر} از ${x}

source: ${p} {is now|becomes|goes} longer than ${x}
fa: ${p} {الان|تبدیل می شود|می رود} بیشتر از ${x}

source: ${p} {is now|becomes|goes} shorter than ${x}
fa: ${p} {الان|تبدیل به|می رود} کوتاه تر از ${x}

source: ${p} {is now|becomes|goes} {larger|more} than ${x}
fa: ${p} {الان|تبدیل می شود|می رود} {بزرگتر|بیشتر} از ${x}

source: ${p} {is now|becomes|goes} {smaller|less} than ${x}
fa: ${p} {الان|تبدیل می شود|می رود} {کوچکتر|کمتر} از ${x}

source: ${p} {is now|becomes|goes} {heavier|larger} than ${x}
fa: ${p} {الان|تبدیل می شود|می رود} {سنگین تر|بزرگتر} از ${x}

source: ${p} {is now|becomes|goes} {lighter|smaller} than ${x}
fa: ${p} {الان|تبدیل به|می رود} {سبکتر|کوچکتر} از ${x}

source: ${p} {is now|becomes|goes} {hotter|higher} than ${x}
fa: ${p} {الان|تبدیل می شود|می رود} {گرمتر|بالاتر} از ${x}

source: ${p} {is now|becomes|goes} {cooler|colder|lower} than ${x}
fa: ${p} {اکنون|تبدیل می شود|می رود} {سردتر|سردتر|کمتر} از ${x}

source: ${p} {is now|becomes|goes} {farther|more distant|longer} than ${x}
fa: ${p} {الان|تبدیل می شود|می رود} {دورتر|دورتر|طولانی تر} از ${x}

source: ${p} {is now|becomes|goes} {nearer|closer|shorter} than ${x}
fa: ${p} {الان|تبدیل به|می رود} {نزدیکتر|نزدیک تر|کوتاه تر} از ${x}

source: ${p} {is now|becomes|goes} {bigger|larger} than ${x}
fa: ${p} {الان|تبدیل می شود|می رود} {بزرگتر|بزرگتر} از ${x}

source: ${p} {is now|becomes|goes} smaller than ${x}
fa: ${p} {الان|تبدیل به|می رود} کوچکتر از ${x}

source: ${p} {is now|becomes|goes} {faster|quicker|speedier} than ${x}
fa: ${p} {الان|تبدیل می شود|می رود} {سریعتر|سریعتر|سریعتر} از ${x}

source: ${p} {is now|becomes|goes} {slower|more slowly} than ${x}
fa: ${p} {الان|تبدیل به|می رود} {آهسته تر|آهسته تر} از ${x}

source: ${p} {is now|becomes|goes} {after|later than} ${x}
fa: ${p} {الان|تبدیل می شود|می رود} {بعد از|بعد از} ${x}

source: ${p} {is now|becomes|goes} {before|earlier than|sooner than} ${x}
fa: ${p} {الان|تبدیل به|می رود} {قبل از|از قبل|زودتر از} ${x}

source: the ${param} {is|is equal to|is one of|is either} ${pair}
fa: این ${param} {این است|برابر با|یکی از|یا} ${pair}

source: the ${param} is {not|neither} ${pair}
fa: این ${param} این است {نه|هیچ کدام} ${pair}

source: between ${v1} and ${v2}
fa: بین ${v1} و ${v2}

source: in the range from ${v1} to ${v2}
fa: در محدوده ای از ${v1} به ${v2}

source: the ${param} is ${range}
fa: این ${param} این است ${range}

source: the ${p} {containing|including} ${x}
fa: این ${p} {شامل|از جمله} ${x}

source: ${x} {in the|in its|in their} ${p}
fa: ${x} {در|در آن|در آن} ${p}

source: the ${p} {being|containing} ${x}
fa: این ${p} {بودن|که شامل} ${x}

source: ${x} {as|in the} ${p}
fa: ${x} {به عنوان|در} ${p}

source: the ${p} containing both ${x} and ${y}
fa: این ${p} که هر دو را دربرگیرنده است ${x} و ${y}

source: the ${p} containing neither ${x} nor ${y}
fa: این ${p} که هیچ کدوم از اینها را شامل نیستند ${x} نه ${y}

source: both ${x} and ${y} in ${p}
fa: هر دو ${x} و ${y} در ${p}

source: the ${p} containing either ${x} or ${y}
fa: این ${p} که شامل هر یک از اینهاست ${x} یا ${y}

source: either ${x} or ${y} in ${p}
fa: یا ${x} یا ${y} در ${p}

source: the ${p} {containing|including} ${x} {but not|without|but no} ${y}
fa: این ${p} {شامل|از جمله} ${x} {اما نه|بدون|اما نه} ${y}

source: ${p} {greater than|higher than|larger than|more than|at least|not less than} ${x}
fa: ${p} {بیشتر از|بیشتر از|بزرگتر از|بیشتر از|حداقل|نه کمتر از} ${x}

source: ${p} {smaller than|lower than|less than|at most|not more than} ${x}
fa: ${p} {کوچکتر از|کمتر از|کمتر از|بیشتر|نه بیشتر از} ${x}

source: ${x} {or more|or higher|or greater|or above} the ${p}
fa: ${x} {یا بیشتر|یا بالاتر|یا بزرگتر|یا بالاتر} این ${p}

source: ${x} {or less|or lower|or below} the ${p}
fa: ${x} {یا کمتر|یا کمتر|یا کمتر} این ${p}

source: over ${x} ${p}
fa: بیش از حد ${x} ${p}

source: ${p} {more expensive|more costly|more} than ${x}
fa: ${p} {گرانتر|هزینه ی بیشتر|بیشتر} از ${x}

source: ${p} {less expensive|cheaper|less} than ${x}
fa: ${p} {ارزانتر|ارزانتر|کمتر} از ${x}

source: ${x} {or more|or above} the ${p}
fa: ${x} {یا بیشتر|یا بالاتر از آن} این ${p}

source: ${x} {or less|or cheaper|or below} the ${p}
fa: ${x} {یا کمتر|یا ارزانتر|یا کمتر} این ${p}

source: ${p} longer than ${x}
fa: ${p} بیشتر از ${x}

source: ${p} shorter than ${x}
fa: ${p} کوتاه تر از ${x}

source: ${x} {or longer|or more} the ${p}
fa: ${x} {یا بیشتر|یا بیشتر} این ${p}

source: ${x} {or shorter|or less} the ${p}
fa: ${x} {یا کوتاه تر|یا کمتر} این ${p}

source: ${p} {larger|more} than ${x}
fa: ${p} {بزرگتر|بیشتر} از ${x}

source: ${p} {smaller|less} than ${x}
fa: ${p} {کوچکتر|کمتر} از ${x}

source: ${x} {or larger|or more} the ${p}
fa: ${x} {یا بزرگتر|یا بیشتر} این ${p}

source: ${x} {or smaller|or less} the ${p}
fa: ${x} {یا کوچکتر|یا کمتر} این ${p}

source: ${p} {heavier|larger} than ${x}
fa: ${p} {سنگین تر|بزرگتر} از ${x}

source: ${p} {lighter|smaller} than ${x}
fa: ${p} {سبکتر|کوچکتر} از ${x}

source: ${x} or more the ${p}
fa: ${x} یا بیشتر از آن ${p}

source: ${x} or less the ${p}
fa: ${x} یا کمتر ${p}
