Repository: Asuse420/genie-toolkit
Catalog: po/*.po
Languages: es, fa, zh_cn

source: resume playing
fa: بازی را بازگردانیم

source: start playing again
fa: دوباره شروع به بازی کردن کنید

source: continue playback
fa: پخش را ادامه دهید

source: continue playing
fa: بازی را ادامه دهید

source: the current skill does not support resuming audio. please report this issue to the skill developer.
fa: مهارت فعلی ، از بازگرداندن صدا پشتیبانی نمی کند. لطفا این مسئله را به توسعه دهنده مهارت گزارش دهید

source: nothing is currently playing yet. to play music, you can say play music.
fa: هنوز هیچ چیزی در حال پخش نیست. برای پخش موسیقی ، می توانید بگویید موسیقی را پخش کنید

source: Genie Configuration
fa: تنظیم Genie

source: A placeholder for configuration parameters of Genie. This device is created and loaded automatically by the system.
fa: یک حامل جایگاهی برای پارامترهای تنظیم کننده جینی. این دستگاه توسط سیستم به طور خودکار ایجاد و بارگذاری می شود

source: Genie ${tier} (${identity})
fa: Genieن ${tier} ( ${identity} )

source: This is one of your Genie apps.
fa: این یکی از برنامه های Genie شماست

source: Volume Control
fa: کنترل صدا

source: Interface for Volume Control.
fa: رابط برای کنترل صدا

source: increase the volume of the speaker
fa: حجم بلندگو را افزایش دهید

source: increase my speaker 's volume
fa: صدای بلندگوی من را افزایش دهید

source: make the speaker louder
fa: بلندتر صدای بلندگو را بسازید

source: increase the speaker volume
fa: صدای بلندگو را افزایش دهید

source: decrease the volume of my speaker
fa: صدای بلندگوی من را کم کنید

source: decrease my speaker 's volume
fa: صدای بلندگو را کم کنید

source: reduce the volume of the speaker
fa: صدای بلندگو را کاهش دهید

source: reduce my speaker 's volume
fa: صدای بلندگو را کاهش دهم

source: make the speaker softer
fa: صدای بلندگو را نرمتر کنید

source: mute my speaker
fa: صدای بلندگوی من را خاموش کن

source: silence my speaker 's volume
fa: صدای بلندگو را ساکت کنید

source: turn off the volume of the speaker
fa: صدای بلندگو را خاموش کنید

source: switch off the sound for my speaker
fa: صدای بلندگو را خاموش کنید

source: mute my speaker 's sound
fa: صدای بلندگویم را خاموش کن

source: make my speaker silent
fa: صدای بلندگویم را ساکت کنم

source: unmute my speaker
fa: صدای بلندگویم را خاموش کن

source: unmute the speaker 's volume
fa: صدای بلندگو را خاموش کنید

source: unmute my speaker 's sound
fa: بلندگویم را بی صدا کنید

source: turn on the speaker sound
fa: صدای بلندگو را روشن کنید

source: stop muting my speaker
fa: دست از صدا دادن بلندگوهایم بردارید

source: set the volume of the speaker
fa: صداهای بلندگو را تنظیم کنید

source: from 0 to 100, what volume do you want to set
fa: از 0 به 100 ، چه درجه صدایی را می خواهید تنظیم کنید ؟

source: volume
fa: صدا

source: value
fa: ارزش

source: Media (news, comics, meme, etc)
es: Medios de comunicación (noticias, cómics, memes, etc)

source: Social Networks (facebook, twitter, etc)
es: Redes sociales (facebook, twitter, etc.)

source: Home (camera, tv, etc)
es: Hogar (cámara, tv, etc.)

source: Communication (phone, email, messenger, etc)
es: Comunicación (teléfono, correo electrónico, mensajería, etc.)

source: Services (weather, calendar, todo list, etc)
es: Servicios (clima, calendario, lista de tareas, etc.)

source: Data Management (cloud drives)
es: Gestión de datos (unidades en la nube)

source: Pick one from the following categories or simply type in.
es: Elija una de las siguientes categorías o escriba directamente.

source: Do it now
es: Hazlo ahora

source: Just notify me
es: Notifícame

source: Back
es: Volver

source: Pick a command from the following devices
es: Elija un comando de los siguientes dispositivos

source: More…
es: Más…

source: Pick a command below.
es: Elija un comando.

source: notify me
es: notifícame

source: Do you want to use your own account or others?
es: ¿Quiere usar su cuenta u otras?

source: Use my own account
es: Usar mi cuenta

source: Use others' account
es: Usar la cuenta de otro

source: Whose account do you want to use?
es: ¿La cuenta de quién quiere utilizar?

source: When
es: Cuando

source: Get
es: Obtener

source: Do
es: Hacer

source: Add more commands and filters or run your command if you are ready.
es: Agregue múltiples comandos y filtros o ejecute su comando cuando esté listo.

source: Add a filter
es: Agregar un filtro

source: Run it
es: Ejecutarlo

source: Click on one of the following buttons to start adding commands.
es: Pulse uno de los siguientes botones para comenzar a agregar comandos.

source: Pick the command you want to add filters to:
es: Elija el comando al que desea agregar el filtro:

source: Pick the filter you want to add:
es: Elija el filtro que quiere agregar:

source: Choose a different command
es: Elija un comando diferente

source: Choose the filter you want to add:
es: Elija el filtro que desea agregar:

source: Sorry, I did not understand that. Use ‘help’ to learn what I can do for you.
es: Lo siento, no entiendí. Utilice 'ayuda' para aprender lo que puedo hacer por usted.

source: if
es: si

source: Sorry, I did not understand that. Try the following instead, or use the Train button to teach me:
es: Lo siento, no entiendí. Pruebe los siguientes comandos en su lugar, o utilice el botón Entrenar para enseñarme.

source: Sorry, I did not understand that. Try the following instead:
es: Lo siento, no entiendí. Pruebe los siguientes comandos en su lugar:

source: Make Your Own Rule
es: Cree su propia regla

source: none of the above
es: Ninguno de estos.

source: Did you mean any of the following?
es: ¿Quiso decir uno de los comandos siguientes?

source: Your last command was a button. I know what a button means. 😛
es: Su último comando fue un botón. Sé lo que significa un botón. 😛

source: Thanks, I made a note of that.
es: Gracias, lo tendré en cuenta.

source: Discovery is not available in this installation of Almond.
es: La búsqueda no está disponible en esta versión de Almond.

source: Sorry, to discover new devices you must log in to your personal account.
es: Lo siento, pero para conectar nuevos dispositivos debe iniciar sesión en su cuenta personal.

source: Register for Almond
es: Regístrese en Almond

source: Searching for devices nearby…
es: Buscando dispositivos cercanos…

source: Can't find any device around.
es: No puedo encontrar ningún dispositivo alrededor.

source: I found the following devices. Which one do you want to set up?
es: Encontré los siguientes dispositivos. ¿Cuál quiere configurar?

source: Sorry, I did not understand that. You might need to enable a new skill before I understand that command. To do so, please log in to your personal account.
es: Lo siento, no entendí. Es posible que deba habilitar una nueva habilidad antes para que pueda entender ese comando. Para hacer esto, por favor inicie sesión en su cuenta personal.

source: Sorry, I did not understand that. You might need to enable a new skill before I understand that command.
es: Lo siento, no entendí. Es posible que deba habilitar una nueva habilidad antes para que pueda enteder el comando.

source: Remote devices are not supported in this version of Almond.
es: Los dispositivos remotos no son compatibles con esta versión de Almond.

source: You need a Matrix account: I talk to other Almonds via the secure Matrix messaging service.
es: Necesita una cuenta Matrix: hablo con otros Almond a través del servicios de mensajería segura de Matrix.

source: Register a new Matrix account now
es: Registre ahora una nueva cuenta Matrix

source: Okay, I'll remember that.
es: Okay, lo tendré en cuenta.

source: Yes this time
es: Sí esta vez

source: Always from anybody (no restrictions)
es: Siempre de cualquier persona (sin restricciones)

source: Always from anybody
es: Siempre de cualquier persona

source: Only if…
es: Solo sí…

source: me
es: yo

source: Would you like to add more elements to the list?
es: ¿Quiere agregar más elementos a la lista?

source: A description of the result
es: Una descripción del resultado

source: None of above
es: Ninguno de estos

source: The account has been set up.
es: La cuenta ha sido configurada.

source: The device has been set up.
es: El dispositivo ha sido configurado.

source: The service has been set up.
es: El servicio ha sido configurado.

source: You don't have a valid address book available.
es: No tiene una libreta de direcciones disponible.

source: No contact matches your search.
es: Ningún contacto coincide con su búsqueda.

source: Hello! I'm Almond, your virtual assistant.
es: ¡Hola! Mi nombre es Almond y soy su asistente virtual.

source: I am part of a research project of Stanford University. I am capable of understanding actions and events over web services. Please keep in mind: I do not chat. Check out the Thingpedia to find out what I understand, or type ‘help’.
es: Soy parte de un proyecto de investigación de la Universidad de Stanford. Soy capaz de comprender acciones y eventos aplicables a servicios web. Por favor tenga en cuenta: no chateo. Eche un vistazo a Thingpedia para averiguar lo que entiendo, o escriba ‘ayuda’.

source: To start, how about you try one of these examples:
es: Para comenzar, qué tal probar uno de estos ejemplos:

source: Get a #cat gif
es: Obtén un gif de #gato

source: Show me the New York Times
es: Muéstrame el New York Times

source: Show me the weather for San Francisco
es: Muéstrame el tiempo que hace en San Francisco

source: What's the stock price of Google?
es: ¿Cúal es el precio de las acciones de Google?

source: Welcome back!
es: ¡Bienvenido de nuevo!

source: You should try again later.
es: Inténtelo nuevamente más tarde.

source: I am part of a research project of Stanford University. I am capable of understanding actions and events over web services.
es: Soy parte de un proyecto de investigación de la Universidad de Stanford. Soy capaz de comprender acciones y eventos aplicables a servicios web.

source: Please keep in mind: I do not chat, and I do not understand questions very well. Please check out the Thingpedia to find out what I understand, or type ‘help’.
es: Por favor tenga en cuenta: no chateo, y no comprendo muy bien las preguntas Eche un vistazo a Thingpedia para averiguar lo que entiendo, o escriba ‘ayuda’.

source: I am part of a research project of Stanford University. Would you like to participate?
es: Soy parte de un proyecto de investigación de la Universidad de Stanford. ¿Quiere participar?

source: With your consent, I will record the commands you give me for training. Recording the commands will allow me to improve my understanding of natural language. I will collect what you type, not your data, or what I reply.
es: Con su consentimiento, grabaré los comandos que introduzca. Grabar los comandos me permitirá mejorar mi comprensión del idioma. Solo recopilaré lo que escriba, no sus datos o mis respuestas.

source: If you would like to participate, please review our consent form, and keep it for your records:
es: Si desea participar, lea nuestro formulario de consentimiento, y guarde una copia personal:

source: Consent Form
es: Formulario de consentimiento

source: Do you consent to recording your commands?
es: ¿Permite la recopilación de sus comandos?

source: Thank you! If you change your mind, you can change the option from Settings.
es: ¡Gracias! Si cambia de opinión, puede cambiar la opción desde la Configuración.

source: Okay, I will not store any command from this Almond. If you change your mind, you can change the option from Settings.
es: Okay, no almacenaré ningún comando de este Almond. Si cambia de opinión, puedes cambiar la opción de la Configuración.

source: Okay, on to what I can do: I am capable of understanding actions and events over web services and smart devices. I do not chat, and I do not understand questions very well. Please check out the Cheatsheet (from the menu) to find out what I understand, or type ‘help’.
es: Okay, continuando con lo que puedo hacer: soy capaz de entender acciones y eventos aplicables a servicios web en línea y dispositivos inteligentes. No chateo, y no comprendo muy bien las preguntas. Eche un vistazo a la Guía de comandos (desde el menú) para averiguar lo que entiendo o escriba ‘ayuda’.

source: Sorry, to allow access to your devices you must log in to your personal account.
es: Lo siento, para permitir el acceso a sus dispositivos debe iniciar sesión en su cuenta personal.

source: Sorry, to execute this command you must log in to your personal account.
es: Lo siento, para ejecutar este comando debe iniciar sesión en su cuenta personal.

source: Show more results
es: Mostrar más resultados

source: Sorry, I did not find any result for that.
es: Lo siento, no he encontrado ningún resultado.

source: Sorry, I don't know how to do that yet.
es: Lo siento, pero todavía no sé cómo hacer lo que me pidió.

source: I agree, but to what?
es: Estoy de acuerdo, pero ... ¿en qué?

source: No way!
es: ¡No existe!

source: Yes what?
es: Sí ¿qué?

source: Please click on one of the provided choices.
es: Por favor pulse en una de las opciones que se muestran.

source: Sorry, but that's not what I asked.
es: Lo siento, pero eso no es lo que pedí.

source: In fact, I did not ask for anything at all!
es: De hecho, ¡no pedí nada!

source: Sorry, I need you to confirm the last question first.
es: Lo siento, necesito que confirme primero la última pregunta.

source: I'm looking for a command.
es: Buscando un comando.

source: I'm looking for a filter
es: Buscando un filtro

source: In fact, I'm not even sure what I asked. Sorry!
es: De hecho, no estoy completamente seguro de lo que pedí. ¡Lo siento!

source: I'm sorry, you don't have permission to do that.
es: Lo siento, no tiene permiso para hacer eso.

source: Consider it done.
es: Considérelo hecho.

source: Missing $F parameter for feed shared app
zh_cn: 共享订阅应用缺少参数 $F

source: %s is not a feed shared app
zh_cn: %s 不是一个共享订阅应用

source: Generic Bluetooth Device %s
zh_cn: 通用蓝牙设备 %s

source: This is a Bluetooth device of unknown or generic type
zh_cn: 这是一个未知类型或通用类型蓝牙设备

source: Platform has no bluetooth capability
zh_cn: 当前平台没有蓝牙功能

source: Omlet Account of %s
zh_cn: %s的Omlet账户

source: This is your Omlet Account. You can use it to communicate and share data with your friends!
zh_cn: 这是你的Omlet账户。你可以使用它来与你朋友交流、共享数据！

source: You
zh_cn: 你

source: This is your own ThingEngine.
zh_cn: 这是你的ThingEngine.

source: Timer at %s elapsed.
zh_cn: %s时设置的计时器到时了。

source: Builtin Interfaces
zh_cn: 内置接口

source: Time and other non-device specific things.
zh_cn: 时间和其他非设备特定的Things。

source: Current time is %s
zh_cn: 当前时间是 %s

source: Timer Elapsed
zh_cn: 计时器时间到

source: Phone
zh_cn: 手机

source: Access your phone capabilities from Sabrina.
zh_cn: 从Sabrina访问你的手机功能
