Repository: Asuse420/genie-toolkit
Catalog: po/*.po
Languages: es, fa, zh_cn

source: send me a {reminder|message} for ${date}
fa: یک پیام بفرستید {یادآوری|پیام} برای ${date}

source: send me a {reminder|message} in ${duration}
fa: یک پیام بفرستید {یادآوری|پیام} در ${duration}

source: send me a {message|alert|notification|reminder|popup notification} ${timer} {saying|with the text} ${message}
fa: یک پیام بفرستید {پیام|هشدار|خبر رسانی|یادآوری|خبر رسانی پاپ اپ} ${timer} {گفتن|با متن} ${message}

source: {{remind me|tell me to|send me an alert|send me a reminder} to ${message} {on|at} ${date}|{set an|} alarm at ${date} named ${message}}
fa: {{یادم بیاور|به من بگو|هشداری برای من بفرستید|یک یادآوری به من بفرستید} به ${message} {در|در} ${date}|{یک|} در خطر ${date} نامگذاری شده ${message}}

source: {{remind me|tell me|{set an|} alarm|send me an alert|send me a reminder} to ${message} in ${duration}|set a timer for ${duration} {named|saying|with the text} ${message}}
fa: {{به من یادآوری کنید|به من بگو|{یک|} خطر زن|یک هشدار بفرستید|یک یادآوری برای من بفرستید} به ${message} در ${duration}|یک ساعتبندی برای ${duration} {نامگذاری شده|بیان|با متن} ${message}}

source: set a {timer|alarm} ${timer}
fa: یک {زمانبندی|خطر زن} ${timer}

source: set a {alarm|timer} for ${date}
fa: یک {خطر زن|زمانبندی} برای ${date}

source: {set a|} {timer for|alarm in} ${duration}
fa: {یک|} {زمانبندی برای|خطر زن} ${duration}

source: alert me ${stream} {saying|with the text} ${constant}
fa: خبر کن ${stream} {بیان|با متن} ${constant}

source: show {the notification|the message|a popup notification that says|a popup containing} ${constant} ${stream}
fa: نمایش {خبر رسانی|پیام|یک خبرپاپ که می گوید|یک پاپ اپ که شامل} ${constant} ${stream}

source: say ${c}
fa: بگو ${c}

source: send me a message saying ${c}
fa: یک پیام بفرستید که می گوید ${c}

source: show a popup that says ${c}
fa: یک پاپ اپ نشان دهید که می گوید ${c}

source: ${table} {with|having} ${param}
fa: ${table} {با|داشتن} ${param}

source: ${table} if ${filter}
fa: ${table} اگر ${filter}

source: ${table} {which|that} have ${filter}
fa: ${table} {که|که} دارایی ${filter}

source: ${table} {|,} {and having|and with|, with|and have} ${filter}
fa: ${table} {|,} {و داشتن|و با|, با|و این} ${filter}

source: ${table} {|,} {with|having|that have} ${filter}
fa: ${table} {|,} {با|داشتن|که} ${filter}

source: ${table} {|,} {which|that} {is|are} ${filter}
fa: ${table} {|,} {که|این} {این است|اینها} ${filter}

source: ${table} {|,} {which|that} ${filter}
fa: ${table} {|,} {که|که} ${filter}

source: ${table} {|,} {which|that} have ${filter}
fa: ${table} {|,} {که|که} دارایی ${filter}

source: ${table} {|,} and {is|are} ${filter}
fa: ${table} {|,} و {این است|اینها} ${filter}

source: ${table} {|,} and have ${filter}
fa: ${table} {|,} و این ${filter}

source: ${table} {|,} and ${filter}
fa: ${table} {|,} و ${filter}

source: {any|some} ${phrase} {with|having} ${filter}
fa: {هر کدام|بعضی ها} ${phrase} {با|داشتن} ${filter}

source: ${phrase} {with|having} ${filter}
fa: ${phrase} {با|داشتن} ${filter}

source: {any|some} ${phrase} {which|that} {has|have} ${filter}
fa: {هر کدام|بعضی ها} ${phrase} {که|این} {این کار را کرده|دارایی} ${filter}

source: {any|some} ${phrase} {which|that} {is|are} ${filter}
fa: {هر کدام|بعضی ها} ${phrase} {که|این} {این است|اینها} ${filter}

source: {any|some} ${phrase} {which|that} ${filter}
fa: {هر کدام|بعضی ها} ${phrase} {که|که} ${filter}

source: ${phrase} {which|that} {has|have} ${filter}
fa: ${phrase} {که|که} {دارای|دارایی} ${filter}

source: ${phrase} {which|that} {is|are} ${filter}
fa: ${phrase} {که|که} {این است|اینها} ${filter}

source: ${phrase} {which|that} ${filter}
fa: ${phrase} {که|که} ${filter}

source: {any|some} ${filter} ${phrase}
fa: {هر کدام|بعضی ها} ${filter} ${phrase}

source: {any|some} ${phrase} ${filter}
fa: {هر کدام|بعضی ها} ${phrase} ${filter}

source: ${table} {get|have} ${filter}
fa: ${table} {دست پیدا کردن|دارایی} ${filter}

source: ${table} {|,} and {get|have} ${filter}
fa: ${table} {|,} و {دست پیدا کردن|دارایی} ${filter}

source: {maximum|highest} ${p}
fa: {حداکثر|بالاترین} ${p}

source: {minimum|lowest} ${p}
fa: {حداقل|کمترین} ${p}

source: {most costly|most expensive|maximum} ${p}
fa: {گرانترین|گرانترین|حداکثر} ${p}

source: {least costly|cheapest|minimum} ${p}
fa: {کم هزینه|ارزان ترین|حداقل} ${p}

source: {longest|most lasting} ${p}
fa: {طولانی ترین|ماندگارترین} ${p}

source: shortest ${p}
fa: کوتاهترین ${p}

source: {maximum|largest} ${p}
fa: {حداکثر|بزرگترین} ${p}

source: {minimum|smallest} ${p}
fa: {حداقل|کوچکترین} ${p}

source: {heaviest|largest|maximum} ${p}
fa: {سنگینترین|بزرگترین|حداکثر} ${p}

source: {lightest|smallest|minimum} ${p}
fa: {سبکترین|کوچکترین|حداقل} ${p}

source: {hottest|highest|maximum} ${p}
fa: {گرمترین|بالاترین|حداکثر} ${p}

source: {coolest|lowest|minimum} ${p}
fa: {خنک ترین|کمترین|حداقل} ${p}

source: {farthest|most distant|longest} ${p}
fa: {دورترین|دورترین|طولانی ترین} ${p}

source: {nearest|closest|shortest} ${p}
fa: {نزدیکترین|نزدیکترین|کوتاهترین} ${p}

source: {largest|biggest} ${p}
fa: {بزرگترین|بزرگترین} ${p}

source: smallest ${p}
fa: کوچکترین ${p}

source: {fastest|quickest|speediest} ${p}
fa: {سریعترین|سریعترین|سریعترین} ${p}

source: {slowest|most slowly} ${p}
fa: {آهسته ترین|آهسته تر} ${p}

source: {latest|most recent} ${p}
fa: {آخرین|آخرین} ${p}

source: {earliest|soonest} ${p}
fa: {اول|سریعترین} ${p}

source: ${t} {with|which has|which have} the ${argminmax}
fa: ${t} {با|که|که} این ${argminmax}

source: ${t} {that|which} ${argminmax}
fa: ${t} {این|که} ${argminmax}

source: ${t} {that|which} {is|are} ${argminmax}
fa: ${t} {این|که} {این است|اینها} ${argminmax}

source: ${t} {that|which} {is|are} the ${argminmax}
fa: ${t} {که|که} {این است|اینها} این ${argminmax}

source: ${t} {with|which has|which have} ${argminmax}
fa: ${t} {با|که|که} ${argminmax}

source: ${t} and the ${argminmax}
fa: ${t} و ${argminmax}

source: ${t} and have the ${argminmax}
fa: ${t} و این ${argminmax}

source: ${t} and ${argminmax}
fa: ${t} و ${argminmax}

source: ${t} and {is|are} ${argminmax}
fa: ${t} و {این است|اینها} ${argminmax}

source: ${t} and {is|are} the ${argminmax}
fa: ${t} و {این است|اینها} در ${argminmax}

source: ${t} {has|gets} the ${argminmax}
fa: ${t} {دارای|بدست می آید} این ${argminmax}

source: ${t} {is|are} ${argminmax}
fa: ${t} {این است|اینها} ${argminmax}

source: ${t} {is|are} the ${argminmax}
fa: ${t} {این است|اینها} این ${argminmax}

source: ${t} {and|and has} the ${argminmax}
fa: ${t} {و|و این} این ${argminmax}

source: ${t} and {|is|are} ${argminmax}
fa: ${t} و {|این است|اینها} ${argminmax}

source: ${t} and {|is|are} the ${argminmax}
fa: ${t} و {|این است|اینها} این ${argminmax}

source: {when|if} the ${p} {becomes|becomes equal to} ${x}
fa: {زمانی|اگر} این ${p} {تبدیل می شود|برابر می شود با} ${x}

source: {when|if} the ${p} {becomes greater than|becomes higher than|goes above|increases above} ${x}
fa: {زمانی|اگر} این ${p} {بزرگتر از|بیشتر از|بالای آن می رود|بیشتر از این} ${x}

source: {when|if} the ${p} {becomes smaller than|becomes lower than|goes below|decreases above} ${x}
fa: {زمانی|اگر} این ${p} {کوچکتر از|کمتر از|به پایین می رود|بیشتر از این کاهش می یابد} ${x}

source: {when|if|in case|whenever|any time|should|anytime} ${table} {change|update}
fa: {زمانی|اگر|در صورت|هر وقت|هر وقت|باید|هر وقت} ${table} {تغییر|به روز کردن}

source: {when|if|in case|whenever|any time|should|anytime} ${table} update
fa: {زمانی|اگر|در صورت|هر وقت که|هر وقت|باید|هر وقت} ${table} به روز کردن

source: {in case of changes|in case of variations|in case of updates|if something changes|when something changes|if there are changes|if there are updates} in ${table}
fa: {در صورت تغییرات|در صورت تغییرات|در صورت بروز داده ها|اگر چیزی تغییر کند|وقتی چیزی تغییر می کند|اگر تغییراتی وجود داشته باشد|اگر به روز شده باشد} در ${table}

source: {when|if|in case|whenever|any time|anytime} ${proj} changes
fa: {زمانی|اگر|در صورت|هر وقت|هر وقت|هر وقت} ${proj} تغییرات

source: {when|if|in case|whenever|any time|should|anytime} ${table} change and ${filter}
fa: {زمانی|اگر|در صورت|هر وقت|هر وقت|باید|هر وقت} ${table} تغییر و ${filter}

source: ${table} {with|having|that has|that have|which has|which have} ${p} ${subquery}
fa: ${table} {با|داشتن|که|که|که|که} ${p} ${subquery}

source: ${table} with ${p} ${subquery}
fa: ${table} با ${p} ${subquery}

source: ${table} {who|which|that} ${p} ${subquery}
fa: ${table} {چه کسی|که|که} ${p} ${subquery}

source: ${table} {of|for|in} ${p} ${subquery}
fa: ${table} {از|برای|در} ${p} ${subquery}

source: ${table} 's ${p} ${subquery}
fa: ${table} "" ${p} ${subquery}

source: ${table} {and|and have|and also|and in addition|but also} ${p} ${subquery}
fa: ${table} {و|و|و همچنین|و علاوه بر آن|اما همچنین} ${p} ${subquery}

source: the first
fa: اولین

source: the former
fa: اولی

source: the second
fa: دومی

source: the latter
fa: دومی

source: each other
fa: همدیگر

source: one another
fa: همدیگر

source: pairs of ${table} {such that|that} ${pronoun_the_first} {is|are|was|were} {the|a|} ${param} of ${pronoun_the_second}
fa: جفت های ${table} {که|که} ${pronoun_the_first} {این است|اینها|این بود|در حال حاضر} {این|الف|} ${param} از ${pronoun_the_second}

source: pairs of ${table} {such that|that} ${pronoun_the_first} {has|have|had} ${pronoun_the_second} as {the|a|} ${param}
fa: جفت های ${table} {که|که} ${pronoun_the_first} {دارای|دارای|در آن زمان} ${pronoun_the_second} به عنوان {این|الف|} ${param}

source: pairs of ${table} {such that|that} ${pronoun_the_first} {has|have|had} ${condition}
fa: جفت های ${table} {که|که} ${pronoun_the_first} {این کار را انجام داده|دارایی|در آن زمان} ${condition}

source: pairs of ${table} {such that|that} ${pronoun_the_first} {is|are|was|were} {the|a|} ${condition}
fa: جفت های ${table} {که|که} ${pronoun_the_first} {این است|اینها|این بود|در حال حاضر} {این|الف|} ${condition}

source: pairs of ${table} {such that|that} ${pronoun_the_first} {is|are|was|were} ${condition}
fa: جفت های ${table} {که|که} ${pronoun_the_first} {این است|اینها|این بود|اینها} ${condition}

source: pairs of ${table} {such that|that} ${pronoun_the_first} ${condition}
fa: جفت های ${table} {که|این} ${pronoun_the_first} ${condition}

source: ${table} {pairs|} {that|which|who} {are|were} {the|} ${param} of ${each_other}
fa: ${table} {جفت ها|} {که|که|که} {اینها|در حال حاضر} {این|} ${param} از ${each_other}

source: {pairs of|} ${table} {that|which|who} {are|were} {the|} ${condition}
fa: {جفت های|} ${table} {که|که|چه کسی} {اینها|در حال حاضر} {این|} ${condition}

source: {pairs of|} ${table} {that|which|who} {are|were} ${condition}
fa: {جفت های|} ${table} {این|که|چه کسی} {اینها|در حال حاضر} ${condition}

source: {pairs of|} ${table} {that|which|who} ${condition}
fa: {جفت های|} ${table} {که|که|چه کسی} ${condition}

source: ${table1} {and|with} the ${table2} ${param2} of {its|their} ${param1}
fa: ${table1} {و|با} این ${table2} ${param2} از {این|آن ها} ${param1}

source: {hello|hi}! i can help you {find a ${table[plural=one]}|{find|search for} ${table[plural=other]}}.
fa: {سلام|سلام} من می توانم به شما کمک کنم {پیدا کنید ${table[plural=one]}|{پیدا کردن|جستجو برای} ${table[plural=other]}}

source: {hello|hi}! i can help you ${action}.
fa: {سلام|سلام} من می توانم به شما کمک کنم ${action}

source: ${ctx} {hello|hi} {!|,} {how can i help you|what are you interested in|what can i do for you} ?
fa: ${ctx} {سلام|سلام} {!|,} {چطور می توانم به شما کمک کنم|شما به چه چیزی علاقه دارید|چه کاری می توانم برای شما بکنم} ؟

source: ${ctx} {how can i help you|what are you interested in|what can i do for you} ?
fa: ${ctx} {چطور می توانم به شما کمک کنم|شما به چه چیزی علاقه دارید|چه کاری می توانم برای شما بکنم} ؟

source: ${ctx} alright , {bye !|good bye !}
fa: ${ctx} بسیار خب ، {خداحافظ|خداحافظ}

source: ${ctx} alright, let me know if I can help you with anything else!
fa: ${ctx} خب ، بزارید اگر بتونم در موارد دیگه بهتون کمک کنم

source: ${preamble} I {will|am going to} ${stmt}
fa: ${preamble} من {تصمیم گیری|من می خواهم} ${stmt}

source: ${ctx} ${no_thanks_phrase} {goodbye !|}
fa: ${ctx} ${no_thanks_phrase} { خداحافظ | }

source: ${ctx} ${thanks_phrase} {goodbye !|}
fa: ${ctx} ${thanks_phrase} { خداحافظ | }

source: ${ctx} ${reject_phrase} {can you try|how about} ${answer} {instead ?|}
fa: ${ctx} ${reject_phrase} {آیا می توانید امتحان کنید|چطوره} ${answer} {بجای آن ؟|}

source: ${ctx} ${ok_thanks_phrase} {goodbye !|}
fa: ${ctx} ${ok_thanks_phrase} { خداحافظ | }

source: {anything|one|something}
fa: {هر چیزی|یک|چیزی}

source: {option|choice}
fa: {انتخاب|انتخاب}

source: Test Device
fa: دستگاه آزمایش

source: Test Genie in various ways
fa: Genieن را به طرق مختلف آزمایش کنید

source: the answer is ${data}
fa: پاسخ این است ${data}

source: ${__index:ordinal: =1{first answer for ${count} items of size ${size} is ${data}.} one{${__index}st answer is ${data}.} two{${__index}nd answer is ${data}.} few{${__index}rd answer is ${data}.} other{${__index}rd answer is ${data}.}}
fa: ${__index:ordinal: =1{first answer for ${count} تعدادی از اندازه ها ${size} این است ${data} . } یک { ${__index} جواب این است ${data} . } دو { ${__index} و پاسخ این است ${data} . } تعداد اندکی { ${__index} جواب بعدی این است ${data} . } بقیه { ${__index} جواب بعدی این است ${data} . } }

source: get data on test
fa: داده های آزمایشی را دریافت کنید

source: How much fake data do you want?
fa: چقدر اطلاعات جعلی می خواهید ؟

source: the answers for ${count} items of size ${size} are ${data}
fa: پاسخ برای ${count} اندازه ی محصولات ${size} اینها ${data}

source: second test data
fa: داده آزمایش دوم

source: the answer is ${number}
fa: پاسخ این است ${number}

source: get sequence number on test
fa: عدد توالی را در آزمایش دریافت کنید

source: return the next test number
fa: شماره آزمایش بعدی را بیاورید

source: the answer is ${data_out}
fa: پاسخ این است ${data_out}

source: duplicate data on test
fa: داده های نقل شده در آزمایش

source: duplicate ${data_in} data
fa: کپی ${data_in} داده ها

source: What data do you want to duplicate?
fa: چه داده ای را می خواهید کپی کنید ؟

source: eat data on test
fa: اطلاعات مربوط به آزمایش را بخورید

source: consume $data
fa: مصرف $data

source: What do you want me to consume?
fa: شما از من می خواهید چه چیزی مصرف کنم ؟

source: Miscellaneous Interfaces
fa: رابط های متنوع

source: Time, random numbers, and other commands not specific to any skill.
fa: زمان ، اعداد تصادفی ، و دیگر دستورات که به هیچ مهارتی مشخص نیستند

source: miscellaneous interfaces
fa: رابط های متنوع

source: I can give you the current date and time, pick random numbers, and help you set various preferences.
fa: من می توانم تاریخ و زمان فعلی را به شما بدهم ، اعداد تصادفی را انتخاب کنم ، و به شما در تنظیم تعدادی از اولویت ها کمک کنم

source: my current location
fa: محل فعلی من

source: my current position
fa: شغل فعلی من

source: my current geocoordinates
fa: همون مختصات جغرافیایی فعلی من

source: your current location is ${location}
fa: محل فعلی شما ${location}

source: you are currently in ${location}
fa: شما در حال حاضر در ${location}

source: i cannot access your location in this version of Genie
fa: من نمی توانم به موقعیت شما در این نسخه از Genie دسترسی داشته باشم

source: coordinates
fa: مختصات

source: in #
fa: در #

source: at #
fa: در #

source: around #
fa: در اطراف #

source: altitude
fa: ارتفاع

source: at # above sea level
fa: در # بالای سطح دریا

source: bearing
fa: نوار

source: facing #
fa: با نگاهی به #

source: speed
fa: سرعت

source: going at #
fa: در حال رفتن به #

source: moving at #
fa: حرکت در #

source: time
fa: زمان

source: time of day
fa: زمان روز

source: right now, it's ${time}
fa: در حال حاضر ، ${time}

source: it's ${time}
fa: این ${time}

source: the current time is ${time}
fa: زمان حال این است ${time}

source: today 's date
fa: تاریخ امروز

source: date
fa: تاریخ

source: current date
fa: تاریخ فعلی

source: today's date
fa: تاریخ امروز

source: today is ${date}-absolute.
fa: امروز ${date} قطعا

source: random number
fa: عدد تصادفی

source: random integer
fa: عدد کامل تصادفی

source: your number is ${random}
fa: شماره شما ${random}

source: i chose ${random}
fa: من انتخاب کردم ${random}

source: a random integer between $low and $high
fa: یک整數 تصادفی بین $low and $high

source: lower bound
fa: حد پایین

source: minimum number
fa: تعداد حداقل

source: higher than #
fa: بیشتر از #

source: more than #
fa: بیشتر از #

source: upper bound
fa: حد بالا

source: maximum number
fa: تعداد بیشتر

source: number
fa: عدد

source: result
fa: نتیجه

source: my name
fa: اسم من

source: user 's name
fa: نام کاربر

source: your name is ${name}
fa: اسم شما ${name}

source: you are ${name}
fa: شما ${name}

source: i do not know your name yet . would you like to tell me ?
fa: اسم تو را هنوز نمی دانم. دوست داری به من بگویی ؟

source: you have not told me your name yet
fa: شما هنوز اسم خود را به من نگفتید

source: your name
fa: نام شما

source: name
fa: نام

source: information about a device
fa: اطلاعات درباره یک دستگاه

source: information about a skill
fa: اطلاعات درباره مهارت

source: information about a thingpedia device
fa: اطلاعات درباره دستگاه thingpedia

source: information about a supported skill
fa: اطلاعات درباره مهارتی که مورد حمایت قرار دارد

source: help about a skill
fa: کمک در مورد مهارت

source: skill help
fa: کمک مهارت

source: skill documentation
fa: مستندسازی مهارت

source: help with a skill
fa: کمک به مهارت

source: with ${id} , ${help} . visit the thingpedia page for additional information
fa: با ${id} ${help} . برای اطلاعات بیشتر به صفحه thingpedia مراجعه کنید

source: the description of ${id} is ${description} . visit the thingpedia page for additional information
fa: شرح ${id} این است ${description} . برای اطلاعات بیشتر به صفحه thingpedia مراجعه کنید

source: named #
fa: به نام #

source: called #
fa: به نام #

source: documentation
fa: اسناد

source: description
fa: شرح

source: category
fa: دسته بندی

source: in the # category
fa: در دسته #

source: thingpedia page
fa: صفحه thingpedia

source: thingpedia link
fa: لینک thingpedia

source: website
fa: وب سایت

source: link
fa: ارتباط

source: issue tracking website
fa: وب سایت ردیابی مسائل

source: bug report url
fa: url گزارش خطا

source: open a url
fa: یک url باز کنید

source: open a link
fa: یک لینک باز کنید

source: opening files is not possible in this version of Genie
fa: در این نسخه از Genie امکان باز کردن دوتنه ها وجود ندارد

source: what url do you want to open
fa: چه url می خواهید باز کنید

source: what do you want to open
fa: چه چیزی را می خواهید باز کنید

source: page
fa: صفحه

source: to #
fa: به #

source: say
fa: بیان

source: what would you like me to say
fa: چه چیزی از من می خواهید بگویم

source: message
fa: پیام

source: It is ${time}
fa: این ${time}

source: alarm-clock-elapsed
fa: ساعت-اژیر-گذر

source: alert
fa: هشدار

source: It has been ${duration}
fa: این بوده است ${duration}

source: timer expire
fa: زمانبندی به پایان می رسد

source: duration
fa: مدت

source: log a message
fa: پیامی را ثبت کنید

source: record a message
fa: یک پیام ضبط کنید

source: write a message in the logs
fa: یک پیام در dziennik بنویسید

source: write $message in the developer logs
fa: نوشتن $message in the developer logs

source: what should i write in the logs
fa: چه چیزی باید در منگ ها بنویسم

source: what do you want me to write
fa: چه چیزی را می خواهید من بنویسم ؟

source: ask question about Genie
fa: سوالی درباره Genie بپرسید

source: reply to $question
fa: پاسخ به $question

source: what would you like to know
fa: چه چیزی را دوست دارید بدانید

source: reply
fa: پاسخ

source: answer
fa: جواب

source: configure a new skill
fa: مهارت جدیدی را تنظیم کنید

source: enable a new skill
fa: توانایی جدیدی را ایجاد کنید

source: i do not know ${device} yet
fa: نمی دونم ${device} هنوز

source: ${device} is not supported yet
fa: ${device} هنوز از این راه پشتیبانی نشده

source: you need to go to the configure new skill page to enable new skills
fa: شما باید به صفحه تنظیم مهارت جدید بروید تا مهارت های جدید را فعال کنید

source: configure a new $device
fa: یک برنامه جدید را تنظیم کنید $device

source: what device do you want to configure
fa: چه دستگاهی را میخواهید تنظیم کنید

source: set the language
fa: زبان را تنظیم کنید

source: change the language
fa: زبان را عوض کنید

source: set the assistant language
fa: زبان دستیار را تنظیم کنید

source: set the language of the assistant
fa: زبان دستیار را تنظیم کنید

source: ${language} is not supported yet
fa: ${language} هنوز ازش حمایت نشده

source: i do not support ${language} yet
fa: من این را پشتیبانی نمی کنم ${language} هنوز

source: you need to go to the user profile page to change the language
fa: شما باید به صفحه پروفایل کاربر بروید تا زبان را تغییر دهید

source: set the language to $language
fa: زبان را به $language

source: language
fa: زبان

source: set the time zone
fa: منطقه زمانی را تنظیم کنید

source: change the time zone
fa: منطقه زمانی را تغییر دهید

source: set the time zone of the assistant
fa: منطقه زمانی دستیار را تنظیم کنید

source: i cannot change the time zone on this system . use the system settings to change my timezone
fa: من نمی توانم منطقه زمانی را در این سیستم تغییر دهم. از تنظیمات سیستم برای تغییر منطقه زمانی خودم استفاده کنید

source: you need to go to the user profile page to change the time zone
fa: شما باید به صفحه پروفایل کاربر بروید تا منطقه زمانی را تغییر دهید

source: set the time zone to $timezone
fa: منطقه زمانی را به $timezone

source: time zone
fa: منطقه زمانی

source: set the name of the assistant
fa: اسم دستیار را تنظیم کنید

source: set the wake word
fa: کلمه بیداری را تنظیم کنید

source: set the hot word
fa: کلمه ی داغ را تنظیم کنید

source: change the wake word
fa: کلمه بیداری را عوض کنید

source: set the assistant name
fa: اسم دستیار را تنظیم کنید

source: change the assistant name
fa: اسم دستیار را تغییر دهید

source: changing the wake word is not supported yet
fa: تغییر کلمه بیداری هنوز پشتیبانی نشده

source: i do not yet support changing my name
fa: من هنوز از تغییر نامم حمایت نمی کنم

source: set the wake word to $language
fa: کلمه بیداری را به $language

source: word
fa: کلمه

source: change the voice output setting
fa: تغییر تنظیم خروجی صدا

source: voice output is not supported on this platform
fa: صدای تولیدی در این پلتفرم مورد حمایت قرار نگرفته

source: turn ${status} voice output
fa: چرخش ${status} خروجی صدا

source: status
fa: وضعیت

source: preference
fa: ترجیح

source: change the voice input setting
fa: تغییر تنظیم ورودی صدا

source: voice input is not supported on this platform
fa: صدای ورودی در این پلتفرم مورد حمایت قرار نگرفته

source: turn ${status} voice input
fa: چرخش ${status} ورودی صدا

source: change my name
fa: اسمم را عوض کنم

source: set my name
fa: اسمم را بگذار

source: change your name to ${name}
fa: اسم خود را به ${name}

source: set my location
fa: محل خودم را تنظیم کنم

source: set my address
fa: آدرس من را تنظیم کنید

source: remember my location
fa: محل من را به خاطر بیاورید

source: configure my location
fa: محل خودم را تنظیم کنید

source: change your ${type} location to ${name}
fa: تغییر دهید ${type} محل قرار دادن ${name}

source: what type of location would you like to change
fa: چه نوع موقعیتی را دوست دارید تغییر دهید

source: location
fa: محل

source: place
fa: محل

source: address
fa: آدرس

source: as #
fa: به عنوان #

source: set my preferred temperature unit
fa: درجه حرارت مورد علاقه ام را تنظیم کنید

source: change the temperature unit
fa: واحد دمایی را تغییر دهید

source: set the default temperature unit
fa: درجه حرارتی پیش فرض را تنظیم کنید

source: what unit should i use
fa: چه واحدی را باید استفاده کنم

source: unit
fa: واحد

source: stop audio
fa: صدا متوقف کنید

source: stop playing
fa: دست از بازی کردن بکشید

source: stop playback
fa: توقف پخش

source: pause
fa: توقف

source: pause audio
fa: صدا متوقف می شود

source: pause playback
fa: توقف پخش

source: pause playing
fa: توقف پخش

source: resume
fa: بازگو

source: resume audio
fa: صدا را بازگردانیم

source: resume playback
fa: بازگرداندن پخش
