Repository: Asuse420/genie-toolkit
Catalog: po/*.po
Languages: es, fa, zh_cn

source: ${table} and ${table[plural]:select:one{${filter[plural=one]}}other{${filter[plural=other]}}} [plural=table[plural]]
fa: ${table} و ${table[plural]:select:one{${filter[plural=one]} } بقیه { ${filter[plural=other]} } } [plural=table[plural]]

source: would you like to ${action} ?
fa: دوست دارید ${action} ؟

source: would you like me to ${action} for you ?
fa: دوست دارید من این کار را بکنم ؟ ${action} برای شما ؟

source: ${action} {with|having} ${param}
fa: ${action} {با|داشتن} ${param}

source: {ok , do you want me to ${stmt}?|ok, {i am going to|you want to|you would like to} ${stmt}. {do you confirm|is that it|is that correct|is that right}?}
fa: {خب ، می خواهید من این کار را بکنم ؟ ${stmt} ?|بسیار خب ، {من قصد دارم|شما می خواهید|شما دوست دارید} ${stmt} {آیا تایید می کنید|این است که|این درست است|این درسته} ?}

source: ${action} for you
fa: ${action} برای شما

source: your request was completed successfully
fa: درخواست شما به طور موفقیت آمیزی تکمیل شد

source: consider your request done !
fa: درخواست شما را انجام دهید

source: i ${action} . ${result}
fa: من ${action} ${result}

source: ${ctx} ${generic_excitement_phrase} i ${action} .
fa: ${ctx} ${generic_excitement_phrase} من ${action}

source: ${ctx} ${notification_preamble} ${generic_excitement_phrase} i ${action} .
fa: ${ctx} ${notification_preamble} ${generic_excitement_phrase} من ${action}

source: ${ctx} there was an unexpected error with your command . please try again later or report this issue to my developers
fa: ${ctx} یک اشتباه غیرمنتظره در دستور شما وجود داشت. لطفا بعدا دوباره امتحان کنید یا این مشکل را به توسعه دهندگان من گزارش کنید

source: {i could not|it was not possible to} ${action} {:|because} ${ctx}
fa: {من نمی توانستم|این امکان وجود نداشت که} ${action} {:|چون} ${ctx}

source: would you like to try a different ${p} ?
fa: آیا می خواهید یک روش متفاوت را امتحان کنید ${p} ؟

source: would you like a different ${p} ?
fa: آیا شما یک چیز متفاوت می خواهید ؟ ${p} ؟

source: shall i try another ${p} ?
fa: آیا باید یک آزمایش دیگر بکنم ؟ ${p} ؟

source: how about for another ${p} ?
fa: چطوره که یه نفر دیگه ${p} ؟

source: would you like to try a different ${p1} or ${p2} ?
fa: آیا می خواهید یک روش متفاوت را امتحان کنید ${p1} یا ${p2} ؟

source: would you like a different ${p1} or ${p2} ?
fa: آیا شما یک چیز متفاوت می خواهید ؟ ${p1} یا ${p2} ؟

source: shall i try another ${p1} or ${p2} ?
fa: آیا باید یک آزمایش دیگر بکنم ؟ ${p1} یا ${p2} ؟

source: how about for another ${p1} or ${p2} ?
fa: چطوره که برای یک نفر دیگه ${p1} یا ${p2} ؟

source: {there ${ctx.aggregationCount:plural:one{is}other{are}}|i see|i have} ${ctx.aggregationCount} ${ctx.aggregationCount:plural:one{${table[plural=one]}}other{${table[plural=other]}}} {like that|with those characteristics}
fa: {آنجا ${ctx.aggregationCount:plural:one{is} بقیه {اینها}}|می دونم|من این را دارم} ${ctx.aggregationCount} ${ctx.aggregationCount:plural:one{${table[plural=one]}} بقیه {${table[plural=other]}}} {مثل این|با این ویژگیها}

source: {there ${ctx.aggregationCount:plural:one{is}other{are}}|i see|i have} ${ctx.aggregationCount} ${ctx.aggregationCount:plural:one{${table[plural=one]}}other{${table[plural=other]}}}
fa: {آنجا ${ctx.aggregationCount:plural:one{is} بقیه {اینها}}|می بینم|من این را دارم} ${ctx.aggregationCount} ${ctx.aggregationCount:plural:one{${table[plural=one]}} بقیه {${table[plural=other]}}}

source: minimum
fa: حداقل

source: smallest
fa: کوچکترین

source: maximum
fa: حداکثر

source: largest
fa: بزرگترین

source: average
fa: متوسط

source: total
fa: کل

source: ${ctx} the ${op} ${p} is ${c}
fa: ${ctx} این ${op} ${p} این است ${c}

source: ${p1} and ${p2}
fa: ${p1} و ${p2}

source: ${p1} , ${p2} {,|} and ${p3}
fa: ${p1} ${p2} {,|} و ${p3}

source: {can you tell me|} what is {the|its} ${param} ?
fa: {می تونید به من بگید|} چه چیزی است {این|این} ${param} ؟

source: can you tell me {the|its} ${param} ?
fa: می تونید به من بگید {این|این} ${param} ؟

source: {can you tell me|} what ${param} does it have ?
fa: {می تونید به من بگید|} چه ؟ ${param} آیا این وسیله ای دارد ؟

source: i would like to {know|see} {the|its} ${param} {first|} .
fa: من دوست دارم {می دونید|ببین} {این|آن} ${param} {اول|}

source: i need {the|its} ${param} {first|} .
fa: من نیاز دارم {این|این} ${param} {اول|}

source: i just need {the|its} ${param} .
fa: فقط نیاز دارم {این|این} ${param}

source: {can you tell me|} what {is|are} {the|its} ${params} ?
fa: {می تونید به من بگید|} چه ؟ {این است|اینها} {این|آن} ${params} ؟

source: can you tell me {the|its} ${params} ?
fa: می تونید به من بگید {این|این} ${params} ؟

source: i would like to {know|see} {the|its} ${params} {first|} .
fa: دوست دارم {می دونید|ببین} {این|این} ${params} {اول|}

source: i need {the|its} ${params} {first|} .
fa: من نیاز دارم {این|این} ${params} {اول|}

source: i just need {the|its} ${params} .
fa: فقط نیاز دارم {این|این} ${params}

source: {can you tell me|} what is the ${param} of the ${base} ?
fa: {می تونید به من بگید|} این چه چیزی است ${param} از ${base} ؟

source: can you tell me the ${param} of the ${base} ?
fa: می تونید به من بگویید ${param} از ${base} ؟

source: {can you tell me|} what ${param} does the ${base} have ?
fa: {می تونید به من بگید|} چه ؟ ${param} این کار را می کند ${base} داشته باشید ؟

source: i would like to {know|see} the ${param} of the ${base} {first|} .
fa: دوست دارم {میدانیم|ببین} این ${param} از ${base} {اول|}

source: i just need {the|its} the ${param} of the ${base} .
fa: فقط نیاز دارم {این|این} این ${param} از ${base}

source: {can you tell me|} what is the ${base} 's ${param} ?
fa: {می تونید به من بگید|} چه چیزی ${base} "" ${param} ؟

source: can you tell me the ${base} 's ${param} ?
fa: می تونید به من بگویید ${base} "" ${param} ؟

source: i would like to {know|see} the ${base} 's ${param} {first|} .
fa: من دوست دارم {می دونید|ببین} این ${base} "" ${param} {اول|}

source: i just need {the|its} the ${base} 's ${param} .
fa: فقط نیاز دارم {این|این} این ${base} "" ${param}

source: {can you tell me|} what {is|are} the ${params} of the ${base} ?
fa: {می تونید به من بگید|} چه ؟ {این است|اینها} این ${params} از ${base} ؟

source: can you tell me the ${params} of the ${base} ?
fa: می تونید به من بگویید ${params} از ${base} ؟

source: {can you tell me|} what ${params} does the ${base} have ?
fa: {می تونید به من بگید|} چه ؟ ${params} این کار را می کند ${base} داشته باشید ؟

source: i would like to {know|see} the ${params} of the ${base} {first|} .
fa: دوست دارم {میدانید|ببین} این ${params} از ${base} {اول|}

source: i just need {the|its} the ${params} of the ${base} .
fa: فقط نیاز دارم {این|این} این ${params} از ${base}

source: {can you tell me|} what is the ${base} 's ${params} ?
fa: {می تونید به من بگید|} چه چیزی ${base} "" ${params} ؟

source: can you tell me the ${base} 's ${params} ?
fa: می تونید به من بگویید ${base} "" ${params} ؟

source: i would like to {know|see} the ${base} 's ${params} {first|} .
fa: دوست دارم {میدانیم|ببین} این ${base} "" ${params} {اول|}

source: i just need {the|its} the ${base} 's ${params} .
fa: فقط نیاز دارم {این|این} این ${base} "" ${params}

source: {can you tell me|} does {it|this|that} have ${param} ?
fa: {می تونید به من بگید|} انجام می دهد {این|این|این} دارای ${param} ؟

source: {can you tell me|} is there ${param} ?
fa: {می تونید به من بگید|} وجود دارد ${param} ؟

source: i would like to {know|see} {if|whether} {it|this|that} has ${param} {first|} .
fa: من دوست دارم {می دونید|ببین} {اگر|آیا} {این|این|که} دارای ${param} {اول|}

source: i would like to {know|see} {if|whether} there is ${param} {first|} .
fa: دوست دارم {میدانیم|ببین} {اگر|آیا} این وجود دارد ${param} {اول|}

source: {can you tell me|} does {it|this|that} ${param} ?
fa: {می تونید به من بگید|} انجام می دهد {این|این|این} ${param} ؟

source: i would like to {know|see} {if|whether} {it|this|that} ${param} {first|} .
fa: من دوست دارم {می دونید|ببین} {اگر|آیا} {این|این|که} ${param} {اول|}

source: {can you tell me|} is {it|this|that} ${param} ?
fa: {می تونید به من بگید|} این است {این|این|که} ${param} ؟

source: i would like to {know|see} {if|whether} {it|this|that} is ${param} {first|} .
fa: من دوست دارم {می دونید|ببین} {اگر|آیا} {این|این|این} این است ${param} {اول|}

source: {can you tell me|} is it ${param} ?
fa: {می تونید به من بگید|} این ${param} ؟

source: {can you tell me|} does the ${base} have ${param} ?
fa: {می تونید به من بگید|} این کار را می کند ${base} دارایی ${param} ؟

source: i would like to {know|see} {if|whether} the ${base} has ${param} {first|} .
fa: دوست دارم {میدانید|ببین} {اگر|آیا} این ${base} دارای ${param} {اول|}

source: {can you tell me|} does the ${base} ${param} ?
fa: {می تونید به من بگید|} این کار را می کند ${base} ${param} ؟

source: i would like to {know|see} {if|whether} the ${base} ${param} {first|} .
fa: دوست دارم {می دونید|ببین} {اگر|آیا} این ${base} ${param} {اول|}

source: {can you tell me|} is the ${base} ${param} ?
fa: {می تونید به من بگید|} این ${base} ${param} ؟

source: i would like to {know|see} {if|whether} the ${base} is ${param} {first|} .
fa: من دوست دارم {میدانید|ببین} {اگر|آیا} این ${base} این است ${param} {اول|}

source: {can you tell me|}
fa: { می تونید به من بگید | }

source: i would like to {know|see}
fa: من دوست دارم {می دونید|ببین}

source: i would like to {know|see} the
fa: من دوست دارم {می دونید|ببین} این

source: {can you tell me|} what are {the|their} ${param} ?
fa: {می تونید به من بگید|} چه چیزی هستند {این|آنها} ${param} ؟

source: can you tell me {the|their} ${param} ?
fa: می تونید به من بگید {این|آنها} ${param} ؟

source: can you tell me the ${param} {for both of them|for all of them} ?
fa: می تونید به من بگویید ${param} {برای هر دوشون|برای همه آنها} ؟

source: i would like to {know|see} {both of|} {the|their} ${param} {first|} .
fa: من دوست دارم {می دونید|ببین} {هر دو|} {این|آنها} ${param} {اول|}

source: i need {the|their} ${param} {first|} .
fa: من نیاز دارم {این|آنها} ${param} {اول|}

source: i just need {the|their} ${param} .
fa: فقط نیاز دارم {این|آنها} ${param}

source: {can you tell me|} do {they|these|those} have ${param} ?
fa: {می تونید به من بگید|} انجام دهید {آنها|اینها|آن ها} دارایی ${param} ؟

source: {can you tell me|} are there ${param} ?
fa: {می تونید به من بگید|} وجود دارند ${param} ؟

source: i would like to {know|see} {if|whether} {they|these|those} have ${param} {first|} .
fa: دوست دارم {می دونید|ببین} {اگر|آیا} {آنها|اینها|آن ها} دارایی ${param} {اول|}

source: i would like to {know|see} {if|whether} there are ${param} {first|} .
fa: دوست دارم {می دونید|ببین} {اگر|آیا} در آنجا ${param} {اول|}

source: {can you tell me|} do {they|these|those} ${param} ?
fa: {می تونید به من بگید|} انجام دهید {آنها|اینها|آن ها} ${param} ؟

source: i would like to {know|see} {if|whether} {they|these|those} ${param} {first|} .
fa: من دوست دارم {می دونید|ببین} {اگر|آیا} {آنها|اینها|آن ها} ${param} {اول|}

source: {can you tell me|} are {they|these|those} ${param} ?
fa: {می تونید به من بگید|} اینها {آنها|اینها|آن ها} ${param} ؟

source: i would like to {know|see} {if|whether} {they|these|those} are ${param} {first|} .
fa: من دوست دارم {میدانید|ببین} {اگر|آیا} {آنها|اینها|آن ها} اینها ${param} {اول|}

source: does {that|it|this} have ${param} ?
fa: انجام می دهد {این|این|این} دارایی ${param} ؟

source: does {that|it|this} ${param} ?
fa: انجام می دهد {که|این|این} ${param} ؟

source: is {that|it|this} a ${param} ${base} ?
fa: این است {این|این|این} الف ${param} ${base} ؟

source: is {the|this|that} ${base} ${param} ?
fa: این است {این|این|این} ${base} ${param} ؟

source: is {that|it|this} a ${base} ${param} ?
fa: این است {که|این|این} الف ${base} ${param} ؟

source: is {that|it|this} a ${base} {that|which} ${param} ?
fa: این است {که|این|این} الف ${base} {که|که} ${param} ؟

source: does {the|this|that} ${base} ${param} ?
fa: انجام می دهد {این|این|این} ${base} ${param} ؟

source: is {that|it|this} a ${base} {that has|with} ${param} ?
fa: این است {که|این|این} الف ${base} {که|با} ${param} ؟

source: does {the|this|that} ${base} have ${param} ?
fa: انجام می دهد {این|این|که} ${base} دارایی ${param} ؟

source: {does either of|does any of} {them|these|those} have ${param} ?
fa: {هر کدوم از اینها|هر کدام از} {آنها|اینها|آن ها} دارایی ${param} ؟

source: do they have ${param} ?
fa: آیا آنها ${param} ؟

source: {does either of|does any of} {them|these|those} ${param} ?
fa: {هر کدام از|هر کدام از} {آنها|اینها|آن ها} ${param} ؟

source: do they ${param} ?
fa: آیا آنها ${param} ؟

source: {is either of|is any of} {them|these|those} a ${param} ${base} ?
fa: {یکی از|هر کدام از} {آنها|اینها|آن ها} الف ${param} ${base} ؟

source: are they ${param} ${base} ?
fa: آیا آنها ${param} ${base} ؟

source: are {the|these|those} ${base} ${param} ?
fa: اینها {این|اینها|آن ها} ${base} ${param} ؟

source: {is either of|is any of} {them|these|those} a ${base} ${param} ?
fa: {یکی از|هر کدام از} {آنها|اینها|آن ها} الف ${base} ${param} ؟

source: are they ${base} ${param} ?
fa: آیا آنها ${base} ${param} ؟

source: {is either of|is any of} {them|these|those} a ${base} {that|which} ${param} ?
fa: {یکی از|هر کدام از} {آنها|اینها|آن ها} الف ${base} {که|که} ${param} ؟

source: are they ${base} {that|which} ${param} ?
fa: آیا آنها ${base} {که|که} ${param} ؟

source: do {the|these|those} ${base} ${param} ?
fa: انجام دهید {این|اینها|آن ها} ${base} ${param} ؟

source: {is either of|is any of} {them|these|those} a ${base} {that has|with} ${param} ?
fa: {یکی از|هر کدام از} {آنها|اینها|آن ها} الف ${base} {که|با} ${param} ؟

source: are they ${base} {that has|with} ${param} ?
fa: آیا آنها ${base} {که|با} ${param} ؟

source: do {the|these|those} ${base} have ${param} ?
fa: انجام دهید {این|اینها|آن ها} ${base} دارایی ${param} ؟

source: {can you tell me|} what is ${name} 's ${param} ?
fa: {می تونید به من بگید|} چه چیزی ${name} "" ${param} ؟

source: {can you tell me|} what is the ${param} of ${name} ?
fa: {می تونید به من بگید|} این چه چیزی است ؟ ${param} از ${name} ؟

source: can you tell me ${name} 's ${param} ?
fa: می تونید به من بگید ${name} "" ${param} ؟

source: can you tell me the ${param} of ${name} ?
fa: می تونید به من بگویید ${param} از ${name} ؟

source: i would like to {know|see} ${name} 's ${param} {first|} .
fa: من دوست دارم {میدانیم|ببین} ${name} "" ${param} {اول|}

source: i would like to {know|see} the ${param} of ${name} {first|} .
fa: دوست دارم {می دونستن|ببین} این ${param} از ${name} {اول|}

source: {can you tell me|} what is ${name} 's ${params} ?
fa: {می تونید به من بگید|} چه چیزی هست ${name} "" ${params} ؟

source: {can you tell me|} what is the ${params} of ${name} ?
fa: {می تونید به من بگید|} این چه چیزی است ؟ ${params} از ${name} ؟

source: can you tell me ${name} 's ${params} ?
fa: می تونید به من بگید ${name} "" ${params} ؟

source: can you tell me the ${params} of ${name} ?
fa: می تونید به من بگویید ${params} از ${name} ؟

source: i would like to {know|see} ${name} 's ${params} {first|} .
fa: من دوست دارم {میدانید|ببین} ${name} "" ${params} {اول|}

source: i would like to {know|see} the ${params} of ${name} {first|} .
fa: من دوست دارم {می دونید|ببین} این ${params} از ${name} {اول|}

source: does ${name} have ${param} ?
fa: انجام می دهد ${name} دارایی ${param} ؟

source: does ${name} ${param} ?
fa: انجام می دهد ${name} ${param} ؟

source: is ${name} ${param} ?
fa: این است ${name} ${param} ؟

source: is ${name} a ${param} ${base} ?
fa: این است ${name} الف ${param} ${base} ؟

source: is ${name} a ${base} ${param} ?
fa: این است ${name} الف ${base} ${param} ؟

source: is ${name} a ${base} {that|which} ${param} ?
fa: این است ${name} الف ${base} {که|که} ${param} ؟

source: is ${name} a ${base} {that has|with} ${param} ?
fa: این است ${name} الف ${base} {که|با} ${param} ؟

source: {no ,|} ${questions}
fa: {نه ،|} ${questions}

source: {no ,|} ${questions} ?
fa: {نه ،|} ${questions} ؟

source: ${sorry_preamble} {there are no ${base[plural=other]}|i cannot find any ${base[plural=one]}} {matching your request|with those characteristics|like that}.
fa: ${sorry_preamble} {هیچ ${base[plural=other]}|من هیچکدام را پیدا نکردم ${base[plural=one]}} {مطابقت با درخواست شما|با این ویژگیها|مثل این}

source: ${sorry_preamble} {there are no ${base[plural=other]}|i cannot find any ${base[plural=one]}} at the moment {matching your request|with those characteristics|like that}. would you like to be notified when {there are|i have|you have} new ${base[plural=other]}?
fa: ${sorry_preamble} {هیچ کدام از اینها وجود ندارد ${base[plural=other]}|من هیچکدام را پیدا نمی کنم ${base[plural=one]}} در حال حاضر {با درخواست شما مطابقت دارد|با این ویژگی ها|مثل این} . دوست دارید در زمانی که {اینها وجود دارند|من این کار را کرده ام|شما} جدید ${base[plural=other]}

source: ${sorry_preamble} {there are no ${base[plural=other]}|i cannot find any ${base[plural=one]}} {matching your request|with those characteristics|like that}. would you like {a different|another} ${p}?
fa: ${sorry_preamble} {هیچی وجود ندارد ${base[plural=other]}|من هیچکدام را پیدا نکردم ${base[plural=one]}} {با درخواست شما مطابقت دارد|با این ویژگیها|مثل این} . دوست دارید ؟ {یک نوع متفاوت|دیگری} ${p}

source: ${sorry_preamble} i cannot find any result for your search . would you like {a different|another} ${p}?
fa: ${sorry_preamble} من هیچ نتیجه ای برای جستجوی شما پیدا نکردم. دوست دارید ؟ {یک نوع متفاوت|دیگری} ${p}

source: ${sorry_preamble} i cannot find any result for your search.
fa: ${sorry_preamble} من هیچ نتیجه ای از جستجوی شما پیدا نکردم

source: ${sorry_preamble} ${ctx}. would you like to be notified when {there are|i have|you have} new ${base[plural=other]}?
fa: ${sorry_preamble} ${ctx} . دوست دارید در زمانی که {اینها وجود دارند|من این را دارم|شما} جدید ${base[plural=other]}

source: {i see ,|okay|okay ,|yeah|yeah ,} {do you have|can you find|is there|how about} a ${phrase} ?
fa: {می بینم ،|خوبه|خب ،|بله|بله ،} {آیا شما|می توانید|وجود دارد|چطور ؟} الف ${phrase} ؟

source: {i see ,|okay|okay ,|yeah|yeah ,} {do you have|can you find|is there|how about} ${phrase} ?
fa: {می بینم ،|بسیار خوب|خب ،|بله|بله ،} {آیا شما|می توانید|وجود دارد|چطور ؟} ${phrase} ؟

source: {i see ,|okay|okay ,|yeah|yeah ,} {do you have|can you find|is there|how about} ${answer} ?
fa: {می بینم ،|بسیار خوب|خب ،|بله|بله ،} {آیا شما|می توانید|وجود دارد|چطور ؟} ${answer} ؟

source: {i see|i have|i have found} ${name_list} . {|would you like to learn more ?|would you like to learn more about either of them ?|would you like to know more about them ?|would you like to hear more about them ?|are you interested to hear more about any of them ?}
fa: {می دونم|من|من پیدا کردم} ${name_list} {|دوست دارید بیشتر بدانید ؟|آیا می خواهید درباره هر کدام از آنها بیشتر بدانید ؟|می خواهید بیشتر در مورد آنها بدانید ؟|دوست دارید بیشتر در مورد آنها بشنوید ؟|آیا علاقه دارید که بیشتر در مورد هر کدام از آنها بشنوید ؟}

source: {i see|i have|i have found} ${name_list}.
fa: {می دونم|من این کار را انجام داده ام|من پیدا کردم} ${name_list}

source: {i see|i have|i have found} ${name_list}. ${name_list.length:select:=2{both|they|all of them}_{they|all of them}} are ${info[plural=other]}.
fa: {می دونم|من این را دارم|من پیدا کردم} ${name_list} ${name_list.length:select:=2{both|they|all of them} این کار را می کنم {آنها|همه آنها}} اینها ${info[plural=other]}

source: ${proposal}. {they|all of them} are ${info[plural=other]}.
fa: ${proposal} {آنها|همه آنها} اینها ${info[plural=other]}

source: {i see|i have|i have found} ${name_list}. {action}.
fa: {می دونم|من این را دارم|من پیدا کردم} ${name_list} {عمل}

source: {i see|i have|i have found} ${name_list}. ${description}.
fa: {می بینم|من این را دارم|من پیدا کردم} ${name_list} ${description}

source: ${name_list.length:select:=2{both ${name_list} are|${name_list} are both|${name_list} are all}_{${name_list} are all}} ${info[plural=other]}.
fa: ${name_list.length:select:=2{both ${name_list} اینها|${name_list} هر دو اینها|${name_list} همه اینها} این کار را می کنم {${name_list} همه اینها}} ${info[plural=other]}

source: ${p1}, {while|whereas|and} ${p2}.
fa: ${p1} {در حالی که|در حالیکه|و} ${p2}

source: ${p1}, ${p2}, {and|while|whereas} ${p3}.
fa: ${p1} ${p2} {و|در حالی که|در حالیکه} ${p3}

source: {ok|yeah|} {i like|i am interested in|i am intrigued by} ${name} .
fa: {بسیار خوب|بله|} {من دوست دارم|من به|من با این موضوع شگفت زده شدم} ${name}

source: {ok|yeah|} ${name} sounds {good|really good|nice|interesting} .
fa: {بسیار خوب|بله|} ${name} صداها {خوب|واقعا خوب|خوب|جالب}

source: {ok|yeah|} {i will go|i will take|i am good for} ${name} .
fa: {بسیار خوب|بله|} {من میرم|من می خواهم|من برای} ${name}

source: {ok|yeah|} ${generic_preamble_for_action} ${action}
fa: {بسیار خوب|بله|} ${generic_preamble_for_action} ${action}

source: {ok|yeah|} can you tell me more about ${name} ?
fa: {بسیار خب|بله|} می تونید در مورد این موضوع بیشتر بگویی ${name} ؟

source: {ok|yeah|} {i like|i am interested in|i am intrigued by} ${name} . ${tell_me_more_phrase}
fa: {بسیار خوب|بله|} {من دوست دارم|من به این علاقه دارم|من با این موضوع شگفت زده شدم} ${name} ${tell_me_more_phrase}

source: {ok|yeah|} ${name} sounds {good|really good|nice|interesting} . ${tell_me_more_phrase}
fa: {بسیار خوب|بله|} ${name} صداها {خوب|واقعا خوب|خوب|جالب} ${tell_me_more_phrase}

source: how about ${proposal}
fa: چطور ؟ ${proposal}

source: {would you like to|would you like me to} ${action}
fa: {دوست دارید|دوست دارید من این کار را بکنم ؟} ${action}

source: i {recommend|suggest} ${proposal}
fa: من {توصیه|پیشنهاد} ${proposal}

source: {i see|i have|i have found|i have one, it is} ${proposal}
fa: {می دونم|من این کار را کرده ام|من پیدا کردم|من یک تای آن را دارم ،} ${proposal}

source: the answer is ${proposal}
fa: پاسخ این است ${proposal}

source: the ${base[plural=one]} with the highest ${param} is ${proposal}
fa: این ${base[plural=one]} با بالاترین ${param} این است ${proposal}

source: the ${base[plural=one]} with the lowest ${param} is ${proposal}
fa: این ${base[plural=one]} با کمترین ${param} این است ${proposal}

source: the ${argminmax} ${base[plural=one]} is ${proposal}
fa: این ${argminmax} ${base[plural=one]} این است ${proposal}

source: is a ${res[plural=one]}. ${action}
fa: یک ${res[plural=one]} ${action}

source: is a ${res[plural=one]}. ${learn_more_offer}?
fa: یک ${res[plural=one]} ${learn_more_offer}

source: {${proposal}? it is a ${res[plural=one]}.|${proposal}, which is a ${res[plural=one]}?}
fa: {${proposal} ؟ این یک ${res[plural=one]} .|${proposal} , که یک ${res[plural=one]} ?}

source: {${proposal}. it is a ${res[plural=one]}.|${proposal}, which is a ${res[plural=one]}.}
fa: {${proposal} . این یک ${res[plural=one]} .|${proposal} , که یک ${res[plural=one]} .}

source: ${proposal}. it ${pair}
fa: ${proposal} . این ${pair}

source: {there are|i can see|i have found|i can recommend} {many|several} ${base[plural=other]} {matching your request|matching your constraints|with those characteristics|like that|}.
fa: {اینها وجود دارند|من می توانم ببینم|من پیدا کردم|من می توانم توصیه کنم} {خیلی|چند تا} ${base[plural=other]} {با درخواست شما مطابقت دارد|تطبیق محدودیت های شما|با این ویژگیها|مثل این|}

source: {there are|i can see|i have found|i have} ${ctx.resultLength} ${ctx.resultLength:plural:one{${base[plural=one]}}other{${base[plural=other]}}} {in my database|like that|}.
fa: {اینها وجود دارند|می توانم ببینم|من پیدا کردم|من این را دارم} ${ctx.resultLength} ${ctx.resultLength:plural:one{${base[plural=one]}} بقیه {${base[plural=other]}}} {در پایگاه داده من|مثل این|}

source: {are you looking for a|how about a|how about the} ${proposal[plural=one]}
fa: {آیا دنبال یک|چطوره که یک|در مورد} ${proposal[plural=one]}

source: {are you looking for|how about|how about} ${proposal}
fa: {آیا دنبالش هستی ؟|چطوره|چطور ؟} ${proposal}

source: ${preamble} {are you looking for a|how about a|how about the} ${proposal[plural=one]}
fa: ${preamble} {آیا دنبال یک|چطوره که یک|چطوره که} ${proposal[plural=one]}
